{"item_id": "2xVsWBNFwZOx", "item_name": "Cheeseburger In Paradise", "city": "Exton", "neighborhood": "Exton", "price_range": "$$", "cuisine": ["Restaurants", "Burgers"], "stars": 2.5, "item_data": [{"review_id": "r-dSoC1rlw", "review": "When a review is only 1 star, then there really isn't too much to write. The service was inattentive, the cheeseburgers were cooked on the surface of the sun (evidently, based on how charred they were), and there was a large roach that crawled across our table after we were served our food.\n\nA note of warning to waiters: you ARE, in fact, responsible to ensure that the food you serve is a reasonable approximation of how it is ordered, especially if it is visibly cooked less or more than requested of you.", "stars": 1.0, "date": "2010-10-05"}, {"review_id": "NUgsNM1cf_", "review": "Service was good, but the food was not.\n\nAs other reviewers have said, the burgers are not good here. I usually go for a mushroom burger but instead opted for their guacamole bacon burger. It's served on an onion ciabatta roll which did not add anything to the burger except for an overly hard texture, especially when paired with the dry burger patty. The guacamole could have used some more seasoning and the thick-cut bacon was okay. \n\nThe fries that came with the burger were salty and soggy; my husband commented that they were likely old. There was a good amount of other customers in the restaurant , so I'm not really sure why there would be old fries unless they cooked huge batches of them in advance (maybe to keep up with their promise of \"endless french fried potatoes\"?). The sweet potato chips we had as an app were fresh and also a favorite with my family, so I'd suggest getting the chips instead of the fries. \n\nFrom the prices on the menu (around $9 for burgers), you'd think that the food would be good or at least a notch higher than \"decent\". Not so at Cheeseburger in Paradise.\n\nP.S. I had to change a diaper while there and the changing table was inside the handicapped stall. The door on the stall must have been installed improperly because the latch was on the outside of the stall and didn't actually lock. The sink counters were also completely wet. Everything else seemed okay to me.", "stars": 2.0, "date": "2011-02-14"}, {"review_id": "HlkP8kfadf", "review": "I am currently sitting in a booth with a red face , because this place has made me FURIOUS!  From the moment we came in, things have been rotten. We used call-ahead seating and still waited over 20 minutes to get a table. The apps we ordered came out at rapid speed and tasted fine. Then we waited...and waited...and waited. It was another hour and 15 minutes until we saw our burgers.  I wish  the problems ended there. My Mother's \"well done\" burger came out, still BLEEDING! My turkey burger and my husband's Kobe Beef burger came out ice cold. The bacon on mine was fatty and rubbery and my husband's was missing all together.  We had to send back two out of three, along with my bacon to be re-cooked. This also took forever.  The fries were cold and greasy. When it was all said and done (over an hour and a half after we were seated) we ended up with mediocre burgers. The manager did an underwhelming job when it came to her \"appology\"... More like excuses! This was our first and will be our last time at this restaurant. In our opinion, it was not another day in \"paradise\"!", "stars": 1.0, "date": "2012-03-04"}, {"review_id": "De74NBhnba", "review": "Excellent service.  The drinks were delivered very quickly.  The menu was refreshingly different including conch fritters (decent).\n\nWe hit the place about 4:45pm and there were excellent drink specials, honored at the table as well as the bar.\n\nWe were with the kids and their meals were served quickly.", "stars": 4.0, "date": "2009-08-10"}, {"review_id": "bS2bUHyCNL", "review": "Had a business meeting here this afternoon. Had the quesadillas they were amazing. Service was awesome and spot on. Definitely will be back to try more.", "stars": 4.0, "date": "2012-03-04"}, {"review_id": "w7-eI7Ceia", "review": "I really like the design of this place. Very tropical, very beachy which I love. You walk in and painted all over the walls is fish, and birds, and palm trees. Very beachy type drinks and food. Food is excellent I usually get some sort of fish. Very fresh and tasty. The amount of TVs help you keep up with sports if you need to, but if not it's just a nice place to go hang out for a little", "stars": 4.0, "date": "2012-11-09"}, {"review_id": "yXv6HISKFt", "review": "Great place. Awesome, cannot be beat burgers. Good drinks, good service, good prices, great apps. The fried pickles are fantastic. Great desserts as well. Terrific place, totally worth it. Great for kids too.", "stars": 5.0, "date": "2012-06-30"}, {"review_id": "2pqUo-ktWA", "review": "Oh my!  To celebrate her first teenage birthday, my daughter chose Cheeseburger in Paradise...?  Since it was her birthday, we figured, what the heck.  Arrived and were seated immediately.   Took a while for the staff to realize we were there and it appeared they may have forgotten throughout the night too, thus explaining the very slow service.  Considering there were only a few people at tables, that's the only excuse I think might apply.  Had the popcorn shrimp and queso (not necessarily together)  Not bad but basic.  I had the Baja burger supposedly with jack cheese, jalapenos, shredded lettuce and sour cream.  It had cheese and some mixture under the cheese.  The cheese didn't appear melted nor was the burger hot, warm was even a stretch.  Good fries though.  My wife had the fish sandwich.  She was concerned as it was tilapia but still tasted a little \"fishy\".  For tilapia to be fishy...?  Same experience with my daughters burger.  When she doesn't even eat half of it, goes to say it wasn't very good.\n\nJust not up to even an average rating.  So many options in the area, no need to stop here.  Oh, by the way, apparently Thursday night is Karaoke night so be prepared.", "stars": 1.0, "date": "2011-12-02"}, {"review_id": "R5vZEaXrC2", "review": "My son had a good three word review for this place, when he misread the name on the menu. \n\nCheeseburgers and Parasites \n\n\nActually it wasn't that bad, but it wasn't great either. The problem for me, was that if a particular food item is displayed in your restraunts name, it better be damn good. These burgers weren't paradise, they were simply average. They have some decent burger toppings ( I myself got a bleu cheese and onion straw burger, which was decent but not wow) but I was surprised to see that the CheeseBurger in Paradise burger was simply a cheeseburger...served with a pickle. \nTo go along with that, the fries were blah, McDonald's shoestring sized yet not even as crispy, laying somewhat limp on the plate. I prefer steak fries, I like girth ( ...that's what she said!) \n\nUpon being sat, the song \" Cheeseburger in Paradise\" by Jimmy Buffett, was playing over their stereo system. I had a brief but rational worry that this song would be played on a loop as I ate. Thankfully, it wasn't nor were we subjected to JBs entire catalog but the CIP song was peppered liberally in the song rotation , so that we heard it at least 3 times while dining. \n\nThe tikibar decor was cool but not terribly impressive. The service was very good, although it was pretty dead even for a Monday night. My son loved the paper umbrella that came with his kids drink and I could tell that his older sister, who proudly orders drinks and entrees off the regular menu, was seething in jealousy yet too proud with her \"adult\" status to ask for one.. \n\nI didn't use the facilities but both offspring reported that they were \"freaked out\" by the peeping fish placed strategically in the bathrooms. We didn't get dessert but their Chocolate Nachos sounded intriguing , until I saw the faces of a couple nearby, who got the dish. It didn't look pretty. \n\nOverall, it was an average experience. I would not go out of my way to either return to CIP or to avoid it. When there are so many places to choose from, CIP needs to distinguish itself from all the other restraunt chains. My advice would be to \"beef\" up those titular average burgers and to get those rude fish out of the bathrooms, that like to watch people make toilet.", "stars": 3.0, "date": "2009-08-19"}, {"review_id": "_tvwFNHqRG", "review": "A friend just told me the Exton place closed. I'm going to check this.\nI drove by, parking lot is empty and one car backed up to the front door taking things out.. It's closed.", "stars": 4.0, "date": "2012-11-29"}, {"review_id": "D3S0THcocV", "review": "#1 draw here is the tropical drink menu; usually $6-$7 per drink, price goes down to $3 per drink during happy hour.  Food is moderately priced; most of the menu items are under $10.  I never can remember what I eat there which speaks to the very average taste provided.  Also, the restaurant only plays three songs which gets old.", "stars": 3.0, "date": "2012-07-10"}, {"review_id": "s5RQFDnTPG", "review": "I think this might have been one of the WORST dining experiences I have ever had. Nothing about our time at this establishment even resembled passable. Our margaritas were horrible (and came with an awkward robitussen-esque cap full of tequila on the side?!), the burgers were literally inedible-- even the FRIES were bad! How do you mess up fries?! The burgers both came with Kraft singles UNMELTED on top. And the service was incredibly slow. The only and literally only thing this place has going for it, is that the interior decor is cute-ish (including a tiki sports bar with TVs for sports fanatics). I regret not asking to speak to a manager after our experience here.", "stars": 1.0, "date": "2011-09-15"}], "gold_labels": {"R0": -1, "R1": 0, "R2": 0, "R3": 1, "R4": 0}}
{"item_id": "8rb-3VYXE37I", "item_name": "Sharky's Sports Bar & Grill", "city": "Williamstown", "neighborhood": "Williamstown", "price_range": "$$", "cuisine": ["American (Traditional)", "Bars", "Nightlife"], "stars": 2.5, "item_data": [{"review_id": "CVVvBWZB-0", "review": "This place is a dump. Its dirty and the bartenders are NASTY. Much better option down the road at Racks or House of Brews. Don't believe me? Give it a try. Worst bartenders I've ever come across", "stars": 1.0, "date": "2018-07-17"}, {"review_id": "ktBfxK5kNF", "review": "I've tried twice to get in on separate occasions! Once when I was 22 with a NJ state ID but I wasn't allowed in and was told I needed a drivers license or Had to be 24 to get in with regular state ID. Now I'm 23 with a probationary auto license and yet I can't get in still! I am of age and have been served alcohol with my probationary license so I don't understand why this bar is making such a big deal! Funny thing is I wasn't even going to drink on those two occasions I went to hang out with some of My fiance's friends! I honestly am over the fact of getting into this bar to be honest! I cant  say much for the service as I can't get in but this whole I'd thing is just plain stupid!  Its a bar not a damn airport!", "stars": 1.0, "date": "2015-07-19"}, {"review_id": "WsmVWp_mwc", "review": "After Washington Township just experienced a tornado, my family and I had lots of damage to our house, no air, and no food. We decided to grab a bite to eat at the sharkeys, one of the only places open to eat. After we sat down and ordered our drinks the waitress decided to card my 19 year old daughter, keep in mind my family and I were sitting at a table, after she had found out her age we were turned away from eating. Not only was the waitress rude, the bartender then proceeded to yell at us from across the restaurant. I've been to many restaurants in my life and have never experienced such rude service, I would not recommend this place to any family or any person for that matter.", "stars": 1.0, "date": "2015-06-25"}, {"review_id": "S1ELadtrD8", "review": "A great dive bar.  The kind of place you can take over if you bring three friends with you.  Shuffleboard and darts are always available.  Downstairs is usually pretty quiet, while upstairs is louder.  Not a great selection of beer, however they do now have Corona light on tap, which I have never seen before.  \n\nOften have pretty great deals on liquor and beer.  (Fridays: $3 Corona, Saturdays: $5 redbull and vodka)\n\nThe food is pretty good for a dive.  Pretty good wings and sandwiches.\n\nBartenders are pretty friendly.", "stars": 4.0, "date": "2013-08-07"}, {"review_id": "wzJXQK5mWK", "review": "Great wings, crispy and meaty.  Upstairs is for the younger crowd, downstairs for locals.  2 pool tables and American dart boards.", "stars": 3.0, "date": "2015-10-09"}, {"review_id": "hhlFooFXvG", "review": "This is a pretty cool local bar. Went there on a Monday night, not a lot of people there at all. Bartender was good. We just had a few beers. They have a takeout beer section too. Highlights: 2 small size pool tables which were really nice. All the cues were pretty beat up though. They also had a shuffleboard table and dartboard. I didn't eat there, so I'm not sure how the food is. My experience was average. Since then, I've been here about 4 more times, pretty much only to play pool. It's a dive bar but the upstairs is pretty cool when it is open. (Usually after 7pm) They have another pool table up there too.\nUpdate- we come here all the time now, honestly, the experience is hit or miss depending on the the bartender. Most are cool and do a great job, but some are so terrible it makes me not want to come back.", "stars": 4.0, "date": "2017-12-05"}, {"review_id": "FfAIAUxsq8", "review": "This is definitely a locals' bar. It was my second time there and we went for a surprise party. The bartender, Betty... AWESOME and so creative! She makes awesome drinks and shots! Everything was reasonable pricing and we enjoyed it there. Loved their wings/pizza rolls. Delish! My friends didn't love this place, but I think it's who you're with to really enjoy to place. Once you get a few Cotton Candy or Dirty Girl Scout shots in, you're having the time of your life!", "stars": 3.0, "date": "2015-08-11"}, {"review_id": "UvYMI1mjRC", "review": "Food, my quesadilla, was good in size and flavor.  Service was carp, bartender, well we needed to pretty vocal to get a refill. Out waitress, with the personality of a pet rock really had me question my food order.  She delivered the food, nothing else, except an awkward comment about the bill upon delivering food.  Evidently, you pay for food before eating, so they bring the bill while I start to eat, and force me to stop and pay while my food gets cold, not the waitress decision, but her execution was bollocks.  \n\nNo interest in returning to this place, even though it looks like it could be a fun night out....", "stars": 3.0, "date": "2014-03-22"}, {"review_id": "je4j303DxC", "review": "I would go lower than one star if I could. They don't clean anything in there. I went there and had three drinks and was throwing up for 7 hours. They don't clean their soda lines and I doubt they clean much else. If they don't care about the health of their customers they don't deserve to even be open. I will never be back and I hope they go out of business and are replaced by someone who actually cares.", "stars": 1.0, "date": "2016-12-28"}, {"review_id": "OdmlViTePM", "review": "If 0 stars were possible i would leave it.what a scummy place.the so called bartenders are a joke .very rude the food sucks the owner is a piece of trash. The fatboy bouncer is a joke .Hey fat boy your not tough or scary like you portray yourself.Do not eat at this scumbag so called bar.", "stars": 1.0, "date": "2016-08-21"}, {"review_id": "uz1kspDlBh", "review": "My favorite dive bar around town. Betty, the bartender, upstairs, is the best.", "stars": 5.0, "date": "2011-09-04"}, {"review_id": "qJdH1k0mgo", "review": "This is indeed still one of the best dive bars in town.  Free shuffleboard? Yes please.  They also have 3 pool tables (1 upstairs, 2 downstairs).  They also have darts!  We went here with a group of 8.  Had one entire side of the bar to ourselves.  The bartenders were super friendly, but not the most attentive.  In the past the downstairs tends to be the older crowd with the upstairs being considerably younger.  We decided to stay downstairs and we here for about 3 hours or so.  I've never ordered food here and probably never will, but I did see a fair amount of people with food at the bar.  This is the most down to earth, unpretentious sports bars around.  We were probably the most loud and obnoxious people there, but never felt out of place or threatened.  Will always come back.", "stars": 3.0, "date": "2013-04-01"}], "gold_labels": {"R0": 0, "R1": 1, "R2": 1, "R3": 0, "R4": 0}}
{"item_id": "Ucl9Vo5lwrUm", "item_name": "O'Briens Irish Pub", "city": "Tampa", "neighborhood": "Tampa", "price_range": "$$", "cuisine": ["Bars", "Pubs", "Nightlife"], "stars": 4.0, "item_data": [{"review_id": "Rp7uQmJRRY", "review": "I must say that this location is much better than the old location they used to occupy further south in Carrollwood.  There's always plenty of parking and it's a pretty convenient location.  My usual adventures here have been for their annual St. Patrick's Day blowout, which is under a huge tent outdoors, and to watch Gator football games as they are the north Tampa watch location for the Tampa Gator Club.  I've always been met with attentive servers and bartenders every time I have visited.  The food is your average run of the mill Irish bar food, but I think the main attraction is the atmosphere this place provides.", "stars": 3.0, "date": "2013-12-08"}, {"review_id": "ngQu6jHvlE", "review": "I was a huge fan of the old O'Briens with the dive bar atmosphere and friendly service. The new one however is absolutely terrible. Very few of the original staff remained on the payroll and the replacements are rude and just about worthless. To top it off they currently employ bouncers ( for whatever reason is unclear to me considering it is a calm, older crowd overall) and one of which has a Napoleon complex and makes your stay uncomfortable with his patrolling around and instigating problems so he can flex his tiny muscles. The food is decent if you're lucky enough to get the right order and assuming it's still hot when it gets to you. Also, the live bands they have are never good and the place is not rated for sound so all you hear is loud yelling and feedback and your only escape is to the sauna they call the outside bar where you can sweat and battle Mosquitos and watch the owner pound back drinks and make sexual comments to female patrons. Lastly there is no entertainment value. The TV's are not synced to speakers so you can't hear the game and the engineering genius put the dartboard where the waitresses have to walk back and forth to the bar so you're constantly being asked to move. I've given this place multiple chances and really wish I could say something positive but it really is a lot of hype, pricey, and a terrible spot to spend your time and money.", "stars": 1.0, "date": "2014-06-30"}, {"review_id": "k2QawprLQM", "review": "Nice pub! First of all the sliders are amazing!! We also had nachos and it was a lot of food for two.  It was enough for four but it was so good!! We had lunch on a Saturday and I can imagine that Friday and Saturday nights are pretty busy, they have room for music and a great bar.", "stars": 4.0, "date": "2016-06-12"}, {"review_id": "I5AaQ2SM_X", "review": "Fun little Irish bar. Good drinks, good food. Tuesday (tonight) was trivia night. Well done, and a fun time. I would come back  and enjoy.", "stars": 4.0, "date": "2009-03-11"}, {"review_id": "ok565bZUma", "review": "Fantastic waitstaff, great food, great place to hang out with friends or meet new ones", "stars": 5.0, "date": "2017-07-09"}, {"review_id": "OEy8RwwpUJ", "review": "Great crowd, cheap beers and not douchey. Most of the staff has been around for years and you can always count on a consistent experience here. This is a great place for live music or game days. Personally this is hands down the best place for St. Patrick's Day. They feature Irish dancers, bagpipes (maybe not traditionally Irish but still cool) and Irish bands (plus green beer). You will never have to fight to get to the bar and there are plenty of areas to sit down and eat/drink.", "stars": 4.0, "date": "2013-03-21"}, {"review_id": "_FOfzh34P3", "review": "The band No Filter was playing tonight and were excellent. It is a very noisy atmosphere and hard to have a conversation but that's probably because the place is packed and everyone's having fun. Food is typical bar/pub food. The selection of beers is very good even though they were out of the one I wanted to try. If you check in the us a $5.00 off $25.00 or more. Great place to have fun.", "stars": 4.0, "date": "2017-06-10"}, {"review_id": "602sqeHDKZ", "review": "We were here for a friend's birthday celebration on a Friday night, and it was a fun place for a party. We had a reserved table, live entertainment, danced a good part of the night, and basically, had a great time. We had birthday cake and cupcakes too, and they even brought us plates and napkins for them. Everyone seemed to enjoy their food orders. We had already eaten earlier, so we took advantage of their all day everyday pitchers of Killians Red for $7, and the pitchers had iced centers, keeping the beer nicely chilled and enjoyable. We were there at 7, and the  tables filled to capacity by the time the band started up. Lots of dancers on the dance floor too. It was my first time here, and I would come again.", "stars": 5.0, "date": "2018-01-11"}, {"review_id": "jct8ukrnK7", "review": "This is my second year coming to this place for St. Patrick's Day. We were finally lucky enough to have it on a weekend day. \n\nThis place is HUGE. There are a ton if Irish places in Tampa and this place has to be the best place for a St. Patrick's day celebration. Not only do they have a huge inside but they have a huge tent on the outside for live music. I don't live close to this bar but every time I've been here I've always had a good time.", "stars": 4.0, "date": "2013-03-20"}, {"review_id": "GXh01t02AL", "review": "Great ambience, tasty food, and variety of drinks.  The perfect place to watch games and fantastic place to hang out Friday and Saturday night.  Great entertainment that you do not want to stop dancing!!", "stars": 4.0, "date": "2016-10-01"}, {"review_id": "-wW_KnKsQd", "review": "New location has great feel. And food is fantastic. Majorly recommend Potato Leak soup. Also had fish and chips and batter was light, flakely, and well seasoned.  Servers were very friendly. Definitely recommend for as great lunch or happy hour destination.", "stars": 4.0, "date": "2012-02-04"}, {"review_id": "YyOvViXEjw", "review": "Headed to O'Brien's in Carrollwood for a Gator game not expecting much but some cheap beer. I was pleasantly surprised when flipping through their menu and decided to try the Chicken-feta-spinach burger. It was amazing. So delicious, and the sweet-potato fries were so crisp and delectable too. Their menu also featured several authentic Irish dishes (bangers and mash, shepherd's pie, chicken pot pie, etc.) that sounded delicious. The restaurant is a big, open space with nice, clean tables and high-tops. There are TVs everywhere, so no matter where you are seated, you can see what's happening in the game. They also have a large stage area where I'm assuming they do live music, but for the Gator game, they had a HUGE projector taking up the space. The volume was good too...you could hear the game in the entire restaurant. The service was fantastic. I will definitely be back if I'm up in Carrollwood, but they should consider opening a South Tampa location!", "stars": 4.0, "date": "2014-04-03"}], "gold_labels": {"R0": 1, "R1": 1, "R2": 0, "R3": 0, "R4": 1}}
{"item_id": "il_Ro8jwPlHr", "item_name": "Denny's", "city": "Indianapolis", "neighborhood": "Indianapolis", "price_range": "$$", "cuisine": ["American (Traditional)", "Restaurants", "Diners"], "stars": 2.5, "item_data": [{"review_id": "YByDh56Hl1", "review": "Went there at 4am and there was only one waitress. I don't go to Denny's often but I didn't remember the food being that bad, completely unsatisfactory. We only got 3 menus, the waitress only come to our table for drinks, order, food, check. We ran out of drinks and never got a refill of all you can eat pancakes. The ranch tasted like sour milk, I can make better pancakes with a box of \"just add water\" mix. Waste of 40$ for the four of us.", "stars": 1.0, "date": "2016-05-08"}, {"review_id": "3vwdkRRoUe", "review": "I had an immensely frustrating experience here this morning and consequently don't plan to return.  I came in at about 6:20 AM for a cup of coffee and a quiet place to study before an oil change.  Although the hostess station had a sign stating that I needed to wait to be seated, no one acknowledged me.  After 2 minutes of standing there, I called \"Hello?\" audibly into the kitchen and still was not acknowledged.  I finally stood at the hostess station and called the restaurant from my cell phone in an attempt to be acknowledged.  The phone rang loudly into the restaurant for another 3-4 minutes with no acknowledgement.  I finally walked around the restaurant trying to find staff to acknowledge me and found a waitress.  She did not apologize for me not being acknowledged, but told me there was a problem with the gas in the restaurant and they could not prepare and serve food in a timely manner.  Needless to say, I didn't waste any more time here and went to a competitor.  I would recommend you don't waste your time here either.", "stars": 1.0, "date": "2017-08-30"}, {"review_id": "LX2or1Zvpa", "review": "Food was decent, staff were accommodating. Restaurant was a filthy mess, disgusting restrooms; had I visited the facilities 1st, I wouldn't have eaten!", "stars": 2.0, "date": "2015-03-21"}, {"review_id": "LWQJo1dFvA", "review": "The staff here was great. We had a bunch of people includeing two little ones. The waitstaff was fast with the refills and great with the kids. The food was what you exspect at a Dennys and the place was clean.", "stars": 4.0, "date": "2014-03-16"}, {"review_id": "yQJXhZIF6_", "review": "Food was awful!  Hamburger was burnt and cold.  Wrong  toppings. French fries were room temperature and already salt with to much salt. Don't order from there if you're looking for a regular hamburger and fries they can't handle it!!!", "stars": 1.0, "date": "2018-08-12"}, {"review_id": "Hrch9QsiJ0", "review": "I give this Dennys a one star because I found a hair on my plate under the egg I just ate.\nI showed the waitress and she apologized, but clearly it wasn't her fault.\nI would think the cooks would wear hair nets! Hello health department!", "stars": 1.0, "date": "2018-03-30"}, {"review_id": "E1fmNkKr74", "review": "Boy has Dennys stepped their game up!!! \n\nGone are the days of the eggs that you questioned were powdered or not.....the suspect looking half done/half oinking bacon.....and the oily, slippery hashbrowns you assumed were in the potato family.\nDennys has changed y'all, at least on US 31. The service has been great every time I've been there, and the food.....OMG!!, The food is better than it's ever been. Don't worry, I have a picture for you! They still cater to that over 60 senior crowd in the morning, but that's what makes it so endearing to me. The place is clean, and I always leave satisfied. The only reason they didn't get 5 stars was for the Asst.Manager who always looks a mess, and really undeserving of the title. \n\nSo finally,  I'm here to let you know....you don t have to be afraid of Dennys anymore!! At least on US 31.", "stars": 4.0, "date": "2018-02-06"}, {"review_id": "6QQrixryeb", "review": "I haven't been to Denny's since college when it was across the street from my campus.  Since I had to kill some time before my next appointment and wanted a sit- down place to eat some breakfast, I decided to stop here. The food is great and I love the new avocado menu.  The caramel coffee is also new and yummy.  Service is prompt, accomodating, and friendly. I was checked on several times by waitress, host, and busser, so I was never lacking coffee or water.  Also, there is free Wi-fi! Honestly the food and cleanliness is better than some \"fancier\" places like LePeep. I'm glad I stopped by!", "stars": 4.0, "date": "2014-06-11"}, {"review_id": "XM93uG4oK0", "review": "Oh Dennys,  thst you for not making me regret my choice today!  5 stars for days. ..perfect waitress, perfect coffee, perfect food selection. I mean,  come on this is Dennys. ..\"Not very high expectations,\" said the pretentious foodie...Thank you for making literally eat my words. Seriously get the ginger bread French Toast. ..", "stars": 5.0, "date": "2014-11-07"}, {"review_id": "B4zRnPk3L4", "review": "Stopped in to see how the remodel went at this location! It is very nice open air feeling no more yucky carpet! Staff seems so much happier in the changed atmosphere. Food was good as usual. Recommend you stop in and check it out!", "stars": 4.0, "date": "2016-07-13"}, {"review_id": "FP62Ob5oKt", "review": "The only reason it's even getting 1 star is because my biscuits and gravy was great. We walked in, server seen us, and kept messing with syrup bottles in the back. After 5 minutes, she came out and seated us. She had no idea what the soup of the day was, didn't seem to be very good at her job. The tea tasted like it's been in the whatever for a while, very grainy tasting, was not pleased. I'm not from this area, very rarely frequent Greenwood, but I do know that if I ever come back, I will definitely not be eating here.", "stars": 1.0, "date": "2016-05-05"}, {"review_id": "r54WYnTm8q", "review": "If you want to eat here go for breakfast or lunch. Food quality is good, service is fast and friendly .  I wanted to try going at dinner time again. Big mistake. The waitress I had was a smartass. The food was lukewarm at best and the service was slow. It was slow and it isn't hard to see why. I will still be a regular but only for breakfast and lunch", "stars": 1.0, "date": "2018-12-12"}], "gold_labels": {"R0": 0, "R1": 1, "R2": 0, "R3": 0, "R4": 0}}
{"item_id": "Cdytv_YhJO0W", "item_name": "Nipper's Pub", "city": "Woodbury", "neighborhood": "Woodbury", "price_range": "$$", "cuisine": ["Nightlife", "Chicken Wings", "Pubs"], "stars": 3.5, "item_data": [{"review_id": "AROrFmzRJw", "review": "Great place for lunch during the week.  Very cool little place to stop in in the middle of the day and have some good food and a drink.  Food is phenomenal.  I would definitely recommend the hot roast beef with roast beef gravy and horseradish on the side.  \n\nI've been here a couple of times for lunch but never for dinner or the weekends but they have a very nice menu.  Can't wait till summer time comes so I can hang out on the deck bar.", "stars": 5.0, "date": "2015-04-05"}, {"review_id": "V7Dmf4SLOU", "review": "Went tonight for akk you can eat crabs.  Reserved a table which was not available on arrival. and was offered a hightop but that wouldn't work for 4 people so we sat outside. Arrived at 6 pm and was served first order at 640. Next serving came at 730. Waitress was also the bartender and we were going to the bar for drinks and to refill pitcher (she had to go inside since there was no tap for our beer outside). There was only one waitress inside who was also serving outside on the patio.  When we complained, we were told we should have been warned that there would be a wait since there are only two pots cooking the crabs.  On a Saturday night! And understaffed and overworked waitresses! Can you say rip-off?  We got tired waiting and at 8 pm asked for the check.  Since we had TWO servings (according to them that was 2 lbs.) of crab we were charged $25 each!  AYCE is $30.  It's to their benefit to underserve their customers.  I've been coming here for years but it's the first time we've been here for crabs and unless things change, will be the last and I'll spread the word.  Come on, give your customers a fair deal and have enough wait staff and get more burners for more pots.  Put a grill outside and cook on that!  Bill was well over $100 and left hungry.  All manager would do was credit one pitcher of beer and apologize profusely.  She knows us and knows that we never complain but this was not right.", "stars": 1.0, "date": "2014-05-11"}, {"review_id": "ooDlLRn34S", "review": "Happy St Patty's Day! A night out with friends! Great bar friendly staff! Music!  Friendly crowd! Perfect drinks!", "stars": 4.0, "date": "2018-03-17"}, {"review_id": "Bh8Sp3K5ia", "review": "Well there are pluses and minuses.  Good juke box but the volume is so low you can barely hear it.  Sometimes they have some good small bands and that's fun.\n\nThere are two or three regulars, including one older guy, who literally commandeer the television remote, complain whenever you want to listen to some music and act like they own the place.  Annoying as hell.  Time to send them on their way.\n\nBartenders seem like hustlers.  Can the smiles be any more fake?  And they mysteriously disappear, even when things are slow.  I have sat at the bar 15 and more minutes with literally no one staffing the bar.  Off smoking joints in their car?\n\nOh, and I am pretty sure the bartenders rip the place off.  Lots of drink politics: free drinks for bigger than usual tips, nod, nod, wink, wink.  Who wins in the end, really?  Just cut the beer prices a bit and stop the bartenders from shaking down the customers and the establishment.\n\nOh, and the cops need to stop staking this place out.  The stops without probable cause are unconstitutional and disgusting.\n\nAll in all, though, glad the place is around.  Usually good place for some drinks, sports and music.\n\nOld dude, though, please get a room at the assisted living center.  You are not better then anyone just because you are there six nights a week nursing your one Budweiser over hours.  Someone needs to rip the remote from his hand and tell him that, no, we are not turning down the jukebox.  We are cranking it up.", "stars": 3.0, "date": "2014-01-23"}, {"review_id": "w4oW9PHexD", "review": "Love coming here. Been for years. Drinks are well made. Staff is very friendly. Great servers! Love the outside patio. But c'mon, owner of Nipper's, put some money into maintenance! Dark inside (get rid of those cheap paper blinds) and brighten it up! Look at the front door entry! Place looking shabby!", "stars": 3.0, "date": "2017-05-16"}, {"review_id": "_9fzk3G6J7", "review": "Came for the all you can eat snow crabs on a Monday, was not disappointed.  Crabs were great, staff was running around like crazy trying to keep up, and did a damn good job of it.", "stars": 5.0, "date": "2015-06-27"}, {"review_id": "YEkb-xyCR0", "review": "Love coming here. Been for years. Drinks are well made. Staff is very friendly. Great servers! Love the outside patio. But c'mon, owner of Nipper's, put some money into maintenance! Dark inside (get rid of those cheap paper blinds) and brighten it up! Look at the front door entry! Place looking shabby!", "stars": 3.0, "date": "2017-05-18"}, {"review_id": "Yuryu2ePhn", "review": "I went into nippers pub when it was taco night. Each taco was a dollar or so but the meat was cold and it tasted very bland. I've been back and had other items which are good. Stay far away from the tacos though.", "stars": 2.0, "date": "2018-03-09"}, {"review_id": "jNOFLXbLlX", "review": "The wings were fine, but not something that I would seek out, on par with any other small bar like this.  \n\nThe drinks are cheap, our server was friendly.  It seemed like a quiet crowd during happy hour on a Friday night.  Most of the people at the bar appeared to know one another.  Seems like mostly locals, in fact it seems like a lot of people walk to the bar, as there were far fewer cars in the lot than you'd expect for the number of people in the bar.\n\nThere is nothing particularly wrong with Nipper's, but I can't really see much of a reason to go there if it isn't within walking distance.  I prefer Schileen's a bit further up Delsea Drive.", "stars": 2.0, "date": "2014-01-27"}, {"review_id": "IibQU-htSp", "review": "Great neighborhood bar with tasty food and friendly staff! Nice deck and great wings - half price on Wednesday!", "stars": 5.0, "date": "2016-06-19"}, {"review_id": "XIZocE83oD", "review": "Second visit to Nipper's was last night. Went for drinks (which are super affordable). ended up ordering Nipper's Fries. Last visit had wings and a perfect cooked burger! Crowd is a mix of locals with some young kids mixed it.", "stars": 4.0, "date": "2018-07-15"}, {"review_id": "Uy3JsATeS4", "review": "Been coming here for years, but don't get there quite as much as I used to, but still enjoy going there when I want a few beers and maybe some bar food that is close to home.  It also can be fun to people watch at this place.  I also only go on weekends.  It's a good, solid unpretentious, locals bar that has been around for years.  It attracts all ages with a more middle aged and older crowd earlier in the evening, and as it gets later the clientele gets younger.  The crowd can look a little rough around the edges at times.  It is not a place that attracts the hipster, yuppie, or soccer mom crowd.  It gets a more old school, south Jersey crowd.   \n\nThe staff has always been friendly and quick to get you another drink when you're sitting at the bar. They do have pretty good food, and some of the best wings around IMHO. Prices are on the cheap to average side.  They offer a decent selection of beers but don't expect to find a selection of fine wines or fancy cocktails.  In the summer they have a fun, little patio bar.  The place has plenty of big screen TVs to watch the game.  They occasionally have small bands, and when they do it can get very crowded.  Other times it's either a DJ later in the evening, or the jukebox for music.   \n\nOverall, it's a decent, locals south Jersey bar.  The fun, unpretentious, solid blue collar type of bar that is getting harder to find in this day and age.", "stars": 4.0, "date": "2015-06-19"}], "gold_labels": {"R0": 1, "R1": 1, "R2": 1, "R3": 1, "R4": 1}}
{"item_id": "tMkwHmWFUEXr", "item_name": "The Green Pheasant", "city": "Nashville", "neighborhood": "Nashville", "price_range": "$$", "cuisine": ["Restaurants", "Japanese", "Seafood"], "stars": 4.0, "item_data": [{"review_id": "OI6hq_7xWu", "review": "cute ambience that would be great for date night or even girl's night. i went for a small birthday dinner for a girlfriend, we ordered several plates & shared. sadly i don't remember many of the plates but the only thing that stood out in taste was the crab noodles, they were great. everything else didn't really catch my attention on taste besides the broccolini (spelling?) being salty. the cocktails were great & we ordered plenty of hot sake to enjoy our evening. the main reason why I am giving it 3 stars is because the menu is a little pricey (location is downtown nashville off 3rd) & nothing spectacular stood out for it being a new spot in nashville.", "stars": 3.0, "date": "2018-12-16"}, {"review_id": "eaEa3pVZZM", "review": "I've been for both lunch and dinner and The Green Pheasant was exceptional both times. The interior decor of the restaurant is really well done with a unique, modern vibe. The food was excellent. Loved the udon noodles with pork and an egg for lunch as well as the mushrooms and the salmon for dinner!", "stars": 5.0, "date": "2018-12-04"}, {"review_id": "nNIVZOp_UL", "review": "Positives: Different menu, not southern or american food, great atmosphere, good happy hour special, a few good dishes, great sake\n\nNegatives: Average service, high prices, food is not consistent", "stars": 4.0, "date": "2019-04-13"}, {"review_id": "FBJmKLp8yF", "review": "Lets start with the pros : valet parking, cute atmosphere, server very attentive. Perhaps I went on a off day . Lets go, the pheasant dumplings and chicken k ( I forgot the name ) had absolutely no flavor their was no salt on table which made it harder to rehabilitate, ordered the spicy crab noodle first order came out cold ,informed server who was very apologetic, no problem stuff happens. Second order arrived hot but no flavor or spice asked for spicy oil and that made it palatable.", "stars": 3.0, "date": "2019-06-03"}, {"review_id": "7gyJwrk8-H", "review": "I work in the neighborhood and have had the opportunity to stop by the Green Pheasant 3x for dinner and 2x for lunch since it opened a few weeks ago.  These guys are hitting on all cylinders right out of the gate.  I had the Tomago (Japanese egg salad, yes the eggs are FedEx'd from Japan) for lunch one day and Hambuga (hamburger) the next.  These would both appeal to someone who has never had Japanese food to the most serious Japanese food fan.  One of my co-workers had the karate (fried chicken) and it too was incredible.\n\nDinner, the Waloo, A5 Waygu, and King Salmon are my favorites so far. \n\nI will be back again and again and again.", "stars": 5.0, "date": "2018-11-15"}, {"review_id": "qxSilk0RqU", "review": "Great portion size for shared plates. Wonderful atmosphere to go along with it. Flavorful food paired with good service", "stars": 4.0, "date": "2019-01-17"}, {"review_id": "NX58Ixo5wU", "review": "We had an amazing holiday dinner for my company here. The food was amazing, but what sets the Green Pheasant apart is the vibe, the service and the cool places to hang throughout the evening. Their bar was great and the private dining rooms accommodate a variety of meeting/dining needs.", "stars": 5.0, "date": "2019-01-03"}, {"review_id": "vq2ek_0pxu", "review": "Exceeded my expectations. Bring a small group son you can sample the most. I tried so many things it was all great: tebasaki goyza (stuffed chicken wing), sui goyza (steamed dumplings), chahan (fried rice with egg), spice crab noodles (watch out they are spicy), and a pancake thing that I couldn't  find on the online menu to try to remember what it was. The Ambience was trendy and cool. I really enjoyed it.", "stars": 5.0, "date": "2019-03-10"}, {"review_id": "ngzkGTCsEi", "review": "We were pretty disappointed in this meal. The staff was friendly but unhelpful in trying to pick dishes to fit our tastes. Though I'm not sure it would have helped. We tried 6 dishes. The first was basically cold potato salad, pretty much the same as I could pick up at Kroger. The dumplings were bland and flavorless, the curry udon was basically a bowl of mush, and while the trout was good, it could have been trout from any southern restaurant and didn't ring of Japanese flavors at all. The only dish that we enjoyed that had the expected flavoring was the Broccolini with rock shrimp, which was pretty good. 1 for 6 isn't great.\n\nThe drinks were fine but not particularly special at 14 bucks each. The waitress described the atmosphere as a neighborhood Japanese pub but it's just another upscale dining establishment in a town full of them. The ambience or atmosphere is the same as any other in town.\n\nOverall, it was not a terrible meal, but not really a good meal either. Just kind of a dud (and an expensive dud at that) in a town full of much better restaurants. We probably wont return.", "stars": 2.0, "date": "2018-12-22"}, {"review_id": "-dBZ8DgVx4", "review": "Terrific Japanese cuisine with great service. Lovely ambience in super location. Excellent value too. Will upgrade to 5 upon next visit I'm sure, couldn't stay long this visit.", "stars": 4.0, "date": "2018-12-02"}, {"review_id": "jM0_k6lPfD", "review": "We went to The Green Pheasant for the first time on January 5. We knew we were in for a treat when we heard the Two Ten Jack was branching out to a new restaurant concept, and boy, were we not disappointed! I personally think that we were so excited that we ordered too much food, but it was worth it. We ordered a wide variety of foods from their rotating menu and loved every one! In particular, we ordered a selection of raw fish on a bed of sushi rice first. This was the most expensive item we ordered, but it was worth it! Next, we ordered the dandan shishito, the friend rice, the shrimp and asparagus, and the stuffed friend chicken. Everything was phenomenal.  This is definitely a pricey meal - we spent $100 without buying drinks, but it was well worth it for a fancy night out.", "stars": 5.0, "date": "2019-01-31"}, {"review_id": "PdMa8gM03H", "review": "This place is great - a bit pricey- but well worth it. Everything we tried was amazing. We tried fried oysters, tuna tartare, gyoza, shumai, wagyu and toki highball drink. It was all amazing! Great atmosphere, great food.", "stars": 5.0, "date": "2019-05-23"}], "gold_labels": {"R0": 1, "R1": 1, "R2": 1, "R3": 1, "R4": 1}}
{"item_id": "FRYkg_JvsWU9", "item_name": "Altamura", "city": "New Orleans", "neighborhood": "New Orleans", "price_range": "$$", "cuisine": ["Cocktail Bars", "Italian", "Nightlife"], "stars": 3.5, "item_data": [{"review_id": "eX2E8-IDyk", "review": "Wow ,shocked.This Restaurant is not ready for service.When 15 min early we were treated as if we were morons,as the young hostess huffed and brought us to the bar with an empty restaurant,why not or table.The feeling of the place was confusion,late employees running into the dining room making it known that they were late without uniforms on ect.three of them talking on their phones in the dining room,Rookie night ,what a joke.The food was of Olive Garden level if that.To top it off was our walk back to our hotel on St.Charles,as we walk along the side of the restaurant we encounterd three employees smoking what my wife says was weed.We also came across the most disgusting smell that allmost brought our dinner back up.It smelled like dead rats and an overflowing used rancid cooking oil ,as we looked behind their wall that seperate the side walk we witnessed the filthiest ,overflowing dumpster and overflowing spent cooking oil and filth about this small corner section on Jackson ave.We avoid the French Quarter for this very reason.I would be very frightened to see the kitchen.The restrooms were not very clean at all ,bad food is one thing but bad sanitation is deadly.My advice ,stay far away for at least 6 months .BTW we checked their sanitation reports with the City of new Orleans,MAJOR  Violations.They should be ashamed of themselves.", "stars": 1.0, "date": "2016-10-01"}, {"review_id": "WDYb52UViJ", "review": "Please don't let a couple of the negative reviews here turn you away from this really neat spot!! Honestly, our group eats out a lot and have high dining expectations. We saw no evidence of their complaints. There was a full house tonight, and we still had a wonderful experience here! We were greeted warmly by the hostess and seated immediately. Our server and buster were awesome---warm and super nice, just attentive enough with perfect timing and no rushing. Great wine list and really good craft cocktails. Calamari and caprese salad were delicious, as was the spaghetti and meatballs and veal chop with hasselback potatoes. We all shared the appetizer and dessert (tiramisu) because the portions here for every course are HUGE!! It was a bit too chilly to enjoy the beautiful courtyard, but we will be back! They also offer valet parking now! Amazing---", "stars": 5.0, "date": "2016-11-27"}, {"review_id": "ao1qAeyZ2o", "review": "This will be New Orleans' best Italian restaurant in a few months time. \nThe quality of pasta, sauce, meat and service is second to none in the city. \nI highly recommend this place to anyone looking for an excellent meal. \nThe menu is built to support multiple price points and appetites. \nThe wine list is remarkable and has plenty of optionality. \nThe basement setting is quaint and light, very similarly to the pasta they make in house everyday. \nThere is an easy and free valet service. \nI'm thrilled to have this in my neighborhood and am excited to watch Jack and team grow into the space.", "stars": 5.0, "date": "2016-08-26"}, {"review_id": "Yzt0D3Nlb6", "review": "I really wanted to love this place and was so very disappointed.  The room was freezing and there was another couple who ended up moving their seat. Food ranged from marginal to a big fail.  I ordered the clam and pasta- basically a \"brothy\" mess.  Salty, mostly canned clams and no garlic or olive oil distinguishable  and losts of pasta water.  The over all dish was bland yet salty.  My date had the chicken picatta - once again bland.  We got the bill be fore we were finished and left.  There are other places in New Orleans to get Italian fare.  No need to stop here", "stars": 1.0, "date": "2016-10-03"}, {"review_id": "y5CFI3LDxW", "review": "Wow! (A little history, I'm from the New Haven CT area, with lots of Italian heritage, I've been in NO for a long time, and miss the Italian food from that area). \nThis food is spot on! The cheesy bread appetizer Oh man! The veal is over the top!  Service needs to tighten up a bit, but the food makes up for it! Who Dat!  Go for it you will love it!", "stars": 5.0, "date": "2016-09-09"}, {"review_id": "76BktsYWwS", "review": "The food and service were excellent. The only issue was we waited an unusually long time to be served our entrees. So long that we considered paying for our drinks and appetizers and leaving. Finally, about 80 or 90 min later, our entrees arrived.", "stars": 3.0, "date": "2016-10-15"}, {"review_id": "Axuc61PU_j", "review": "Good service.  But, a Manhattan Jack bagel with a small portion of lox and cream cheese for $26??  Good, not great and absurd price.  Char grilled oysters were almost inedible.  Very small, over cooked and dry.  Everyone else ordered Italian for their entree and said ok but nothing special.  Caesar salad very ordinary.  No need to return with many other choices in NOLA.", "stars": 3.0, "date": "2017-05-16"}, {"review_id": "NifdA23IV2", "review": "A delightful experience with delicious food. This weekend 3 of us decided to celebrate a friend's upcoming nuptials with an early dinner. The bride-to-be selected Altamura because none of us had been there. Best decision ever! Our sever, Ron, was knowledgeable and friendly. He explained the menu, made suggestions and answered all of our questions. We started with Caesar and caprese salads. The portions were large and the caesar dressing was yummy. We ordered the king crab pasta w/ black pepper fettuccini, veal scallopini saltimboca and zuppa di pesce for entrees. All 3 were layered in flavors and the pastas had tons of protein in them. The zuppa was a feast of seafood. The veal was like butter. We ordered a side of brussel sprouts that were forgotten by the kitchen. When they finally did come out, they were obviously rushed and undercooked. We had to send them back. We had a cannoli, tiramisu and the Manhattanjack chocolate cake for dessert. The tiramisu was life changing! The cake was served too cold. It would have been better if they let it warm to room temperature before serving. The kitchen forgot the cake's a la mode and we were halfway through before we got the vanilla ice cream. However, it was super yummy! Ron was attentive and followed up immediately on our missing items. We had after dinner cocktails on the beautiful patio. The lemon drink was the perfect nightcap. It was a lovely evening with amazingly flavorful food. The minor glitches in serving side items earned them 4 stars instead of 5.  We plan to return soon and try more deliciousness!", "stars": 4.0, "date": "2017-05-29"}, {"review_id": "WxYzycj-fI", "review": "Liked it enough to give it another try. Heading back this Saturday with a birthday guest. We visited about a month ago. Waiter apologized profusely as it took us 25 minutes to get our cocktails. It was a Friday night and he said there was only one bartender on, usually two, and he was unsure why they had scheduled only one? Salads were good though croutons on the Caesar salad appeared to come out of a bag. Pizza Delicious actually does a better Caesar. Considering the affiliation with Manhattan Jack, this place should do some pretty special croutons. That brings up the bread. While the bread looks divine, the execution was off. Two of us ordered the loaf of garlic bread which we were told might take awhile as each loaf needs to go into the oven. We were fine with that. I don't mind paying for bread, even at an Italian restaurant (Jack knows you never see this in NY/NJ) because I thought this was really going to be special; it wasn't. A beautiful looking loaf of bread appeared that was hot and crusty only on the top. I tasted little to no garlic and ended up with a loaf of cold bread. Only the top crust had any hint of crustiness or garlic. It was not served with butter or oil, so essentially we ended up with a dense loaf of bread that was nothing but plain. I know these guys can do better than that. How about partially slicing the loaf and placing garlic butter in between? We left the entire loaf behind with the exception of the top crust. My husband loved the puttanesca and said it would be hard not ordering it again; he loved it that much. The meatballs were also perfect. I had the cioppino. It was served hot and was a decent size. Looking forward to our friend's birthday celebration and hoping they have done something about the cocktail turnaround time and bread when we return. Also understand they have piano music on Saturdays!", "stars": 3.0, "date": "2016-10-18"}, {"review_id": "UoPLJzx3Hd", "review": "Great food, food awesome bartender. Sat at bar as a single and had an excellent dinner with great conversation\n Ordered the king crab with peppered fettuccine and a ceased salad. Excellent, will return.", "stars": 4.0, "date": "2017-04-06"}, {"review_id": "8e9Fde-fbG", "review": "We have dined in and picked up from Altamura.  I'll tell you our dine in experience first. \n\n7 o'clock reservation on a Thursday night, because neither of us felt like cooking.  So we find ourselves promptly and politely seated immediately.  Nice break from the weekday grind.  Our appetizers and salad courses came quick.  In fact, my salad came so quick, I asked the waiter to bring it back in 5 minutes while we finished our apps.  So finish the first two courses by 7:20 pm.  1 hour later, no entrees.  Me and Shari V are catching up and carrying on, but now we are getting hungry.  So I ask the waitress to check on the food.  She says it'll be one minute.  Great.  Who can complain about 60 seconds.  20 minutes later, I ask the waitress to get the manager.  I ask the manager about our entrees.  She explains that they are catering a party upstairs (as if that matters to me) and that our entrees should be out in 15 minutes.  I told them to forget it and bring us the bill.  A restaurant can screw up in all kinds of ways - bad food, rude waitstaff, mix up an order.  But wasting our time is the cardinal sin.  2 hours later, $60 spent, and we left Altamura hungry.  I was bummed.  Shari V was furious.\n\nI convinced Shari V to retry Altamura for pickup.  She was skeptical but agreed if she didn't have anything to do with the process.  I reordered the Spiedini Mozzarella which is like a delicious gourmet cheese stick.  Fired gooey cheese seasoned with capers. Our entrees were the spaghetti & meatballs for Shari V and the King Crab pasta for me.  I thought both pasta dishes were ok, 3/5.  I liked them but didn't love either.  Shari V's spaghetti was bland (she says lacked depth).  The king crab pasta was overcooked big time.  Made for a soggy dish.  \n\nHard to be objective with Altamura, but I'd give them a 3/5 for food, and a 2/5 for service.  We were so put out with our in-house dining experience.  We will not be repeating.\n\nShari V's quote:  \"Don't bother reviewing them.  Altamura won't be around next year.\"", "stars": 2.0, "date": "2017-02-08"}, {"review_id": "gpfPzUFGIY", "review": "Absolutely phenomenal!!!! I had the king crab pasta and it had the best flavor. The noodles were perfectly prepared and the crab was really fresh. We also had the chocolate cake and it was the best I'd ever tasted. Service was amazing. My glass was always full and the atmosphere was perfect.", "stars": 5.0, "date": "2016-09-25"}], "gold_labels": {"R0": 0, "R1": 1, "R2": 1, "R3": 1, "R4": 1}}
{"item_id": "Dtuf4vD0znzw", "item_name": "Tomo Japanese Steakhouse and Sushi Bar", "city": "Indianapolis", "neighborhood": "Indianapolis", "price_range": "$$", "cuisine": ["Steakhouses", "Restaurants", "Sushi Bars"], "stars": 4.0, "item_data": [{"review_id": "UdKXbsNyrb", "review": "Excellent price for sushi and I love their specialties sushi menu. Snow mountain and Volcano sushi are remarkable sushi!", "stars": 5.0, "date": "2015-02-16"}, {"review_id": "mM8J3bk61L", "review": "Really liked the atmosphere sushi was great.  Service wasn't as attentful as we wanted on a slow day, but was alright.  Will go back again.  Anytime the sushi chef makes it look like art with small details of the knife and placement of ingredients you know it's good.  For that reason would go back!  Not a huge fan of habachi so that's not what I would go there for.", "stars": 4.0, "date": "2015-08-06"}, {"review_id": "einit-mdIb", "review": "These place is so fun!  The food is excellent!  The drinks are good too!  Never had bad service here", "stars": 5.0, "date": "2015-05-12"}, {"review_id": "4C3-zunlyB", "review": "I had a great time at Tomo! The Sake and edamame were very good but the sushi was amazing! I highly recommend the volcano roll - you will be mind blown! :) and don't worry - it looks a little sketchy outside but the inside is full of awesome decor!", "stars": 5.0, "date": "2014-04-01"}, {"review_id": "GLYx11G0MN", "review": "Love love love love this place!  Very entertaining hibachi chefs and unique sushi rolls. I also use them for catering a lot. Perfect for lunch, date night or GNO!", "stars": 5.0, "date": "2018-07-26"}, {"review_id": "8ol-GgIUZa", "review": "Started off on the wrong foot with a coupon problem. The food was good but the raw chicken touched the vegetables.  They also used the same utensils to touch raw chicken and cooked food without washing. Then they put the veggies where the chicken was cooking without cleaning the grill. Not vegetarian friendly.  Nice atmosphere.   Food was good but not outstanding.", "stars": 2.0, "date": "2014-01-19"}, {"review_id": "YGHqjzKfjc", "review": "I have eaten here three times and the food and service has been consistent.\n\nThe space is dark and has some interior design features. Chairs are moderately comfortable. \n\nTheir sushi is good. Not amazing.  But it is consistently good. \n\n\n I have enjoyed their hibachi a few times and it was good. Like any hibachi dinner your impression relies strongly on the chef preparing your food not only for taste but for entertainment. \n\nI have been seated at a table with five people and another visit at a table with ten. The more people at the table it seems the more energy from the chef, the more entertaining, the more you enjoy the experience. \n\n\nOverall it is a good under visited spot.", "stars": 3.0, "date": "2015-04-15"}, {"review_id": "sHfsHt_cv3", "review": "Went to the newest addition to Japanese food on the north side, early on a Wednesday evening. \n\nIt's nice to have another option in the area, that isn't Sakura or H20, and who doesn't love a restaurant where their \"mascot\" is an octopus dressed as a hibachi chef?\n\nThe decor reminded me of something out of a Sims game - black, red and futuristic, a refreshing style for a city that is often full of stale interior design for restaurants. Lots of fancy LED lighting and a bit of tacky fish oriented decorations too, but, it's nice and comfortable and contemporary.  Even the music playing over the loud speaker was downtempo, providing a \"big city\" feel to the establishment.\n\nWe were greeted instantly, and seated in the dining area, being that we were here for sushi and not hibachi. All the hibachi tables were being used though, either by groups or couples.  They also have a larger hibachi in a private area for large groups.\n\nMy friend had some spicy rolls and really enjoyed them. The presentation was clean and crisp. I had some sashimi and the fish was fresh, generous and delicious. I went to Sakura two days later alone, and the nigiri tasted fishy, when the salmon I had at Tomo was fresh and sweet, as salmon should be. \n\nI also had the shrimp tempura appetizer which featured two very large prawns (biggest I've had in the city!) and a nice mix of veggies. They were tasty as well. \n\nThe service was a bit slow, but, needs were met when requests were made. They also have a somewhat vast (for Japanese) wine list and they make fancy cocktails such as mai tai's. I look forward to trying their hibachi and furthering my menu experience, glad to have Tomo here!", "stars": 3.0, "date": "2010-01-09"}, {"review_id": "PdlBiZT860", "review": "Good food...set grille side.....cook was a little low on energy and I felt rushed to leave around the 9:30pm hour and they close at 10pm", "stars": 3.0, "date": "2016-08-26"}, {"review_id": "ebuEeNs-o9", "review": "Those who know good Japanese food, will leave this restaurant more than pleased! We have frequented this establishment at minimum 4 times per month. Over the past 8 years we have never had one disappointment. Service is always on point, sushi has always been fresh and of high quality and hibachi experiences a memory maker. My kids love the chicken katsu, miso soup and many other menu items. Our children always request Tomo for their night out. \nIf you haven't tried this restaurant, put it on the list of must try!", "stars": 5.0, "date": "2018-07-26"}, {"review_id": "EYbGSLOH5y", "review": "This place has solid veggie and vegan options in the sushi.\n\nIt doesn't say one way or another on the menu, but if you're wondering, the giant veggie roll thing has no tamago in it, so vegans, enjoy!\n\nObviously, the avocado, cucumber, asparagus, and such are also fine. I ate so much sushi that I forget what exactly they had.", "stars": 4.0, "date": "2012-03-01"}, {"review_id": "9xlbMCs89z", "review": "Great service, great food, very well priced wine and drinks. They always treat us with free dessert or a coupon for at least $8. It's always such a great experience and the pricing is unbeatable for the amount of actual fish you receive. Nothing bad to say, been here multiple times and is the best sushi in Indy hands down!", "stars": 5.0, "date": "2017-08-08"}], "gold_labels": {"R0": 1, "R1": 1, "R2": 0, "R3": 1, "R4": 1}}
{"item_id": "WKMJwqnfZKsA", "item_name": "Roast Coffeehouse and Wine Bar", "city": "Edmonton", "neighborhood": "Edmonton", "price_range": "$$", "cuisine": ["Coffee & Tea", "Food", "Cafes"], "stars": 4.0, "item_data": [{"review_id": "uwPhE21CZL", "review": "So much to like about this place--the beautiful Mercer Building location, the spaciousness, the lovely, friendly baristas. But there are a couple of important cons for me. Biggest being, the music is constant and too loud, ruining everything you go to a coffee shop to do: read, work, reflect, or enjoy a good conversation. When I asked for it to be turned down, they told me they can't--it just plays at one level all the time, and the speakers  are everywhere so you can't get away from it. It sucks.\n\nSecondly, if you're a tea drinker, you're out of luck. They don't serve the tea in pots, but huge, sloppy individual filters--it makes your beverage totally ungainly, hard to drink and is really off putting.\n\nPros: gluten free goodies and yummy Italian sodas. I'd love to spend more time here, but the music usually drives me out after 10 minutes.", "stars": 3.0, "date": "2012-11-06"}, {"review_id": "bAy8ROEYO_", "review": "I'm not a coffee connoisseur so I'm not reviewing it based on that. What I am reviewing it on is the fantastic ambiance it has, the free wifi, and the long meeting table that's available for everyone.\n\nWhenever I want to hang out and work downtown at a cafe, Roast is the first place I go to. \n\nMy only real complaint is that during some hours, this place is PACKED and so that may put a kink in your plans if you wanted to meet someone there for a meeting. Also wifi is sometimes touch and go. I wish more cafes installed the fastest wifi with signal boosters around the place to make it more useful for those who telework.\n\nI also love that this place is open LATE!", "stars": 4.0, "date": "2013-05-28"}, {"review_id": "zPDHE7TrXs", "review": "I really loved it here, makes me wish I lived closer and could stop by everyday! I had the dark hot chocolate & it was made in every way I like. Milky, chocolatey, whipped creamy..y? They had a maple bacon latte I could've gone for buuuut I just wasn't ready for the challenge. The atmosphere is gorgeous. Wooden floors, dark decor, BIG comfy chairs makes it cozy and warm. They also have a great looking selection of wines and some snacks as well. I think if you're planning to take a date/ co-worker/ hipster friend/ parent here is a great place to do it.\n\nOnly down side is when I went I found it VERY CROWDED. My drink ALTHOUGH WORTH IT took a good while to come about and the lemony water in the pretty dispenser was empty & I was thirsty.\n\nI do love this hipster haven.", "stars": 4.0, "date": "2013-09-04"}, {"review_id": "84niL3fvJM", "review": "The kids who work at Roast are friendly.  They screw up things once in a blue moon, but that's to be expected.\n\nThe cookies offered there are good.  They're not the best that I've ever had, but they're good all the same.\n\nThe pain au chocolate is terrible.  It's some kind of thick, chewy abomination.  Avoid it at all costs.\n\nThe sandwiches are overpriced by about 40%.\n\nThe drinks are good enough, but they're not particularly memorable.", "stars": 2.0, "date": "2013-07-14"}, {"review_id": "pLnTjS90gU", "review": "With a Toast to Roast, I say welcome to the E-town cafe scene! I spent a few hours in this welcoming and inviting space today working & amerced in the awe inspiring ambiance. Located in the historic & newly renovated Mercer building, this coffee house by day/wine bar by night has meticulously mastered creating a spacious environment that embodies the original charm and elegance I so hoped it would have. \n\nThe pastries are fresh and delicious, the intoxicating aroma of the Roasted beans is delish, and the ode to the London Fog called the Morning Mist put a sublime smile on my face for hours after. Yes, I think I have found another regular haunt!", "stars": 4.0, "date": "2012-09-11"}, {"review_id": "5iTI0jGv3w", "review": "Hope everybody had a nice Valentine's Day yesterday! I had a great dinner which lead right into our trip to San Francisco so I'll have to write about it later! In the mean time, just wanted to post up my visit to ROAST Coffeehouse on 104 St!\n\nIt took me a long time to make my way down to ROAST but I finally did it. As much as I love the atmosphere of Transcend (may you return to downtown one day) and Credo, I think I like ROAST the best! Something about the wooden interior, the expansive seating areas and trendy wallpaper makes it a place where I'd want to sit and relax.\n\nJoe and I went on a Sunday afternoon and the place was pretty bustling from what would have expected. Another plus: their menu is extensive, serving up specialty drinks as well (Credo, please expand, I can't drink straight coffee!). ROAST also serves food and wine after 4pm, which makes me want to return ASAP!\n\nFor that day though, we were happy with our drinks. Joe and his regular latte, decorated with their signature 'R' (to go, because he just had a cup of coffee with breakfast), and a dark chocolate mocha for me. This is the first time I've ever had a mocha where I didn't find was too bitter (aside from anything served at Starbucks, pure cream and sugar). Absolutely loved my drink!\n\nROAST Coffeehouse, thus far, is my favorite out of all coffee hangouts. Runner-up: Wild Earth Bakery. I only wished I discovered these places when I was in school! Perfect place to study. What's your favorite coffee place?", "stars": 5.0, "date": "2013-02-22"}, {"review_id": "uwS3uguqJM", "review": "I've only been once, but think Roast is worth plenty more trips in the future.\n\nThe take on a London Fog I had was pretty tasty. I like a little more sweetness but, then, a little less sugar is a healthy thing.\n\nThe place looks fantastic! As part of the re-birth of the Mercer Warehouse, Roast has all the exposed brick, wood, and everything else so often behind walls that anyone could ask for. A very cool space on Edmonton's new cool street. Let me know if you sit at their community table.", "stars": 4.0, "date": "2012-08-16"}, {"review_id": "r-ZglJVC72", "review": "I love Roast, it's my place to escape during a crazy day at the office. Yes, it's quite hipster but I still love it. The brick walls, the pressed tin ceiling, the local artwork and the reclaimed wood tables -- and of course the coffee. I was disappointed when they took their maple bacon latte off the menu, I think that drew in a lot of people here. But they said it cost too much to keep on the menu, unfortunately.\n\nI still enjoy the chocolate cherry latte, it's not as sweet as it sounds. The pumpkin pie latte is also good, and I hear the chai hot chocolate is a treat too. The toasted marshmallow latte is quite sweet though, just to warn you. For a cold option, I like the coconut frap .. it's nice and light, not too sweet. You can switch between cold and hot for most of these options though.\n\nI've always found their pastries to be delicious and never stale, unlike other coffee houses. The lemon swirl is to die for, if you like a strong lemon taste -- lots of flavour in every bite, with chunks of chewy lemon. Yum! The cinnamon swirl and chocolate croissants are also tasty. I was sad when they discontinued their key lime cookie, those were delicious! Unfortunately it wasn't popular enough so they took that off the menu too.\n\nGo earlier in the day if you want to score a pastry with your coffee, otherwise it's usually just sandwiches left by the afternoon and I'm not so sure about those if they've been left out since morning.", "stars": 4.0, "date": "2013-11-19"}, {"review_id": "-EUUhjHqFm", "review": "Great meeting place in the mornings.  Lots of available parking and a great atmosphere.  The latte was really good and Roast has several different flavours that I can't normally find in the chain brands.\n\nService was really good and the drink was made quickly.  Wish they had a paper to read or Avenue magazine but there wasn't anything readily available, but that isn't a huge deal.\n\nSeating is really comfortable and is far better than the mostly wooden chairs you find at large chain coffee shops.  I'll be back again and again.", "stars": 4.0, "date": "2012-10-15"}, {"review_id": "bs4GbC-2ob", "review": "Roast where have you been all my life! How do I love thee, let me count the ways!  1. Being surrounded by what seems like the most comfortable coffee shop seating in the city. 2. Nice exposed brick of a past era. 3. Reclaimed old wood flooring. 4. Down to earth extremely friendly staff. 5. A good mix of the business, student and everyone else crowd. 6. Cozy gas fireplaces. 7. An all around cool atmosphere. All these factors have a way of making 2 or 3 hours fly by. \n\nI got med coffee ($3) and a MAPLE BACON cinnamon bun ($3.75). Nothing here is cheap and admittedly the coffee isn't the best in the city. But I really love the atmophere.\n\nMy only complaints would be that the music can be a little too loud and that some of the tables are wobbly. However, this is one of my favourite places to meet someone for coffee.\n\nI absolutely, positively, most definitely, unequivocally, with out a doubt, love Roast!", "stars": 4.0, "date": "2013-03-04"}, {"review_id": "clgRv3GSaD", "review": "Roast has been around for a little while now, and do indeed have excellent coffee. The café is moderately sized and fairly open, but it makes up for the open space by creating comfortable nooks and separate seating areas throughout the room. There are couches towards the street-side, booths and high tables near the middle, and high-backed chairs and coffee tables located in the direction of the rear.\n\nIt isn't just the coffee or the rustic atmosphere that makes Roast so fantastic, though. They've recently undergone a menu overhaul and, rather than just the usual cakes, pastries, and sweets, now offer breakfast and lunch options à la Chef Andrew Parker, which change daily.\n\nAnd, yeah...they sell wine. It's always a tough decision for me once I reach the counter at Roast, since I love coffee and I adore wine. Roast's wine selection is fabulous because it serves up a variety of reds, whites, and rosés from across Canada, keeping it local and supporting wineries from the Okanagan and Niagara regions.\n\nThe café is also a great location for holding events (particularly literary/artsy ones) or hosting a meeting (they have a Community Room to accommodate them).\n\nDid I mention that they serve a Maple Bacon Latte? (I knew that would sell you on it.)", "stars": 4.0, "date": "2013-10-16"}, {"review_id": "TNL5-aZ6zf", "review": "Delicious coffee, great service, wonderful atmosphere.\nBest soy vanilla latte in town. I don't care how much it costs, it's the best.  But don't you worry, the prices are similar to those of other coffee joints in Edmonton.", "stars": 5.0, "date": "2013-12-16"}], "gold_labels": {"R0": 1, "R1": 1, "R2": 1, "R3": 1, "R4": 1}}
{"item_id": "Mjboz24M9NlB", "item_name": "DeSandro on Main", "city": "Philadelphia", "neighborhood": "Philadelphia", "price_range": "$$", "cuisine": ["Pizza", "Restaurants", "Salad"], "stars": 3.0, "item_data": [{"review_id": "gMBKx_Lj1Z", "review": "Absolutely disgusting. Do yourself a favor and never order from here. Food is terrible", "stars": 1.0, "date": "2016-09-30"}, {"review_id": "wOOsO0pjBl", "review": "So I went to this fine establishment yesterday after a night out on the town. Was looking for some quality pizza and possibly some wings. The wait was a little long but not terrible considering the night rush. I got a large pepperoni and a dozen wings with a side of hot sauce. Everything sounds great right? Pizza tastes good, wings taste good. Me being slightly... buzzed thought nothing of the bill... after all my main mission was to get Pizza. It wasn't until I collected myself this morning that I realized how ridiculous it was that I spent 32 bucks on a pep pizza and a dozen wings. I think you guys can do the math. I got fleeced in my moment of drunkin pizza need. Anyway, go next door. These guys can't operate like decent human beings. I'm sure the owner will read this so my message is: yeah we might be drunk when we order but we remember the next day and apparently this isn't an isolated event according to my friends. Deuces. (Drops mic)", "stars": 1.0, "date": "2016-03-06"}, {"review_id": "3VpM5rIDN5", "review": "Came here one night back in March after being at mad river with a group of people. Came here and got two slices of their chicken honey mustard pizza and it was amazing. My roommates and I often find ourselves thinking about driving up to get some pizza weekly but the 45 minute drive seems to be a bit much just for pizza. Will stop by every time I'm in the area.", "stars": 5.0, "date": "2015-07-05"}, {"review_id": "QW_irbyjhN", "review": "I placed a delivery order at 6:44 and was told it would arrive through grub hub between 7:30 and 7:40. After they did not get there in the time frame, I called and they said it was out for delivery and would be there momentarily. Grub hub then updated the delivery time two more times delaying it further both times! It arrived at 8:11. The food was gross - nothing was even warm, let alone hot. It was soggy, not crispy and it all tasted bland- like no taste and over cooked. Order from somewhere else.", "stars": 1.0, "date": "2016-03-19"}, {"review_id": "nVw-xMQlc9", "review": "Instead of ordering delivery from this place make a reservation at a nice fancy restaurant in center city.... You'll save money \n\nPizza wasn't bad tho", "stars": 2.0, "date": "2016-03-31"}, {"review_id": "shP8yyEfHm", "review": "Stopped here on a late night before catching a movie. We all ordered burgers and fries, the food was OK nothing special. The woman behind the counter wasn't friendly at all. They had a few stools we thought we could eat at ..but the place was so cold inside we opted to eat in the car. Like it's the dead of winter an even the woman behind the counter was wearing a coat which is unsanitary. It was sooooo cold the cheese on my burger was not even melted. I'm sure there are other burger joints on main st. Maybe we should have stuck to the pizza!", "stars": 3.0, "date": "2014-03-02"}, {"review_id": "-6vSL4BJ1k", "review": "We've tried just about every pizza shop in Manayunk & Roxborough. Wish we wouldve found this gem sooner! Can't beat the price!!! The pizza was good. I like the dusting of cornmeal on the dough. It gives the crust a nice texture instead of filling your mouth with flour like all the other pizza shops. The crust was thin, cooked light but not soggy, and the ingredient portions were spot on so nothing was overpowering.", "stars": 4.0, "date": "2013-08-19"}, {"review_id": "E_FFHGcck4", "review": "Ordered a roast pork hoagie with broccoli rabe, arrabiata pasta, and wedding soup from here.  Received a roast pork hoagie with jalapeño peppers, arrabiata pasta with jalapeño peppers (apparently the italian cherry peppers ran out, though I was told jalapeños are basically identical), and my soup was spilled all over the bag.  To their credit, they did replace the soup but the food overall was pretty awful.  I was also told to call back so they can make up the order to me (though I was literally currently on the phone with them regarding the current order).  The pork was incredibly fatty and putting jalapeño peppers in italian pasta is just asinine.  I would not order from here again but maybe by some slim chance the pizza is half decent.", "stars": 1.0, "date": "2014-05-31"}, {"review_id": "cdIlDzC4VQ", "review": "Went for the first time in a while very friendly food was made fresh and fast buffalo cheesesteak wrap is so yummy pizza hot and fresh everything was good!", "stars": 5.0, "date": "2014-11-22"}, {"review_id": "vS9ZuWsAX-", "review": "The only reason I'm giving 2 stars instead of 1 is because my 2-year old liked the pizza.  The chicken cheese steak was overcooked chunks with no flavor....The wings were whole wings without the tips cut off, which just looks unappetizing.....The  cheese steak tasted like a cheap version of Steak-umms.  Oh, and the pizza is lousy!  I really wanted to like this place because they have a big patio and it is byob, but I can't eat there again.", "stars": 2.0, "date": "2013-05-13"}, {"review_id": "gwJAwXZnBC", "review": "I love this place! Being from New York I'm very picky about my pizza. This is the only place in the neighborhood that I go to for pizza. The prices are affordable and the variety of pizza is great. The staff are always very friendly, quick, and kind. I would definitely recommend for lunch or a quick dinner. Out of all the pizza places on Main St. in manayunk, this is my favorite by far!", "stars": 5.0, "date": "2018-06-29"}, {"review_id": "Q3j_5_pfNu", "review": "So this is review is not based on the quality of the food as they never delivered it! On May 26th, I ordered through Grubhub, which turned out to be a lifesaver. Why? Because when I attempted to call them they did not answer. I called back the next day and was told they would not refund me because they tried to deliver it, but no one answered the door. Yet, I never heard the knock, my dog never barked (she goes crazy when someone knocks), and I never got the confirmation that my food is on the way (that Grubhub sends when the restaurant confirms via their app that the food is out for delivery). Simply put, they tried to rip me off, which is something they apparently do to their customers on a fairly consistent basis, based on their other Yelp reviews. Luckily, sine I ordered through GH, they refunded me on their own. I am just pissed that I had included a 20% tip when I ordered. This is my only yelp review, in fact, I signed up just to post this. Customers beware!", "stars": 1.0, "date": "2017-05-30"}], "gold_labels": {"R0": 1, "R1": 1, "R2": -1, "R3": 0, "R4": -1}}
