{"item_id": "9OG5YkX1g2GR", "item_name": "Romano's Macaroni Grill", "city": "Reno", "neighborhood": "Reno", "price_range": "$$", "cuisine": ["Restaurants", "Italian"], "item_data": [{"review_id": "mMwnX1vc3t", "review": "Great bar Happy Hour 4-7 every day. Wine & Drafts $3, $5 pizza, $4.50 apps. To-go Dinners and lunches are very reasonable and fast. Staff are as friendly as it gets.", "stars": 4.0, "date": "2016-01-30"}, {"review_id": "1xU-7HSEvr", "review": "Food showed up cold, salmon was raw inside, plastic in the dessert, fatty lamb chops and some sort of stringy thing at the bottom of my wine glass!! The service was great though.", "stars": 1.0, "date": "2016-04-23"}, {"review_id": "9g2l7g0yd-", "review": "Troy and his staff always make it a really good time at the Macaroni Grill I've been here several times for birthdays and special events they've always taken care of us.\nFantastic food fantastic people.\nNever had a bad time here.", "stars": 5.0, "date": "2017-04-30"}, {"review_id": "wtCN5b8nAF", "review": "I enjoy coming here with my hubby for grown- up meals and drinks. We allways have a good time with the wait staff, whom are knowlageable and friendly. Lunch  today was no exception, we had a supper yummy peach Belini frozen drink WOW! New Summer fav!", "stars": 3.0, "date": "2017-05-26"}, {"review_id": "Fc-EysLAKX", "review": "There is a weird smell when you walk in the door... Not sure what it resembles. The bread was gross, and the food not much better. I should have expected as much because it's macaroni grill, but still. This is the top choice first date restaurant of frat boys trying to be fancy. Meh, at least it's edible.", "stars": 2.0, "date": "2016-03-18"}, {"review_id": "7coGRlBDcC", "review": "Great ambiance, good service and the food is delicious!", "stars": 4.0, "date": "2012-03-01"}, {"review_id": "Lf4U0cCdM6", "review": "If you like SALT, eat here. I should have refused the buffalo chicken dish, but didn't.. Thought I would just give it a THUMBS DOWN on Yelp.  WAY TOO MUCH SALT!!", "stars": 1.0, "date": "2016-05-08"}, {"review_id": "lkFCDfXBfR", "review": "I was surprised to see such low marks on this one... we had a great time! Food was amazing and service was quick/attentive. We sat down after a half-hour wait, and our meals were ready (no joke) in about ten minutes. We ordered appetizers but our main course was so quick, it beat it and the staff threw the appetizer in free. We couldn't be happier and would easily recommend this location for those wanting to get out.", "stars": 5.0, "date": "2017-03-06"}, {"review_id": "tuoglRlUtn", "review": "Italian food consistent and always tastes good when we go. Portions are good for splitting\nit was the great service i appreciate. Our server  Amanda was kind enough to run the items my son left behind out to the parking lot.  Never had bad service or food!! Luv this place", "stars": 4.0, "date": "2014-10-11"}, {"review_id": "A4bABlhyOA", "review": "Brought the family here a few nights ago for dinner. After being seated, we sat for about 15 min without even being asked if we would like a glass of water.  So we grabbed our stuff and headed out the door. We will stick to the Olive Garden in the future.", "stars": 1.0, "date": "2014-07-29"}], "aspect_scores": {"speed": 1.0, "food": 0.62, "value": 1.0, "ambiance": 0.0, "consistency": 1.0, "service": 1.0, "portions": 0.0, "drinks": 0.0, "quiet": 0.0, "private": 0.0, "outdoor": 0.0, "parking": 2.0, "freshness": 0.0, "vegetarian": 0.0, "staff": 0.0, "ordering": 0.0}, "gold_labels": {"C0": 1, "C1": -1, "C2": -1, "C3": 0, "C4": 0, "C5": 0, "C6": -1, "C7": 0}}
{"item_id": "QdN72BWoyFyp", "item_name": "Bar One", "city": "Philadelphia", "neighborhood": "Philadelphia", "price_range": "$$", "cuisine": ["Cocktail Bars", "Bars", "Italian"], "item_data": [{"review_id": "jstzd6bBAi", "review": "Outrageously overpriced for what it is. Insultingly so. It would be one thing if the cocktails warranted $12 but they simply do not. The bartender was very friendly so 2 stars for that but for that area and the subpar cocktails not even close to worth the price. Cannot speak to the food but definitely not a place I would go back to have a few drinks at.", "stars": 2.0, "date": "2017-04-22"}, {"review_id": "DiC22Mh6D_", "review": "Food here is AWESOME. Buffalo chicken egg rolls and lamb burger wrapped and prosciutto was unreal. Staff was really friendly. Great live music and hip atmosphere, definitely coming back!!", "stars": 5.0, "date": "2016-10-22"}, {"review_id": "A78ZQcwZnS", "review": "Have been here twice with my boyfriend. We had great food and service both times. The menu is a good size and there is an airy atmosphere to the place. Mike was behind the bar during the Italian Festival when we stopped in, and he was quite a fella. He was a great example of what good service looks like. The lamb burger is awesome!!", "stars": 4.0, "date": "2017-05-22"}, {"review_id": "sEIAWkRXY8", "review": "First night.  Am here now.  Advertised free passed apps appetizers.  Corner table.  Ignored by EVERY server.  Other tables already had three apps!  If this is an indication of the future, FORGET IT!  And the music is too  loud!", "stars": 1.0, "date": "2016-10-21"}, {"review_id": "Ygd_24TJux", "review": "The best new bar in Philly. Amazing drink menu (and they taste as good as they sound), and delicious apps. The service is incredible and the bar is bustling with an energetic vibe that brings life to the quaint neighborhood. Thank you to Bar One for providing an atmosphere perfect for everyone!!! We can't to become regulars at Bar One!!!", "stars": 5.0, "date": "2016-10-22"}, {"review_id": "z1-fvcX8e5", "review": "Have been twice with my boyfriend and both times had great food and service. The menu is a good size and the place has a nice open airy atmosphere. Mike who was behind the bar is an awesome fella who went above and beyond to make sure we had a good time. The lamb burger was really really good. Check it out :)", "stars": 4.0, "date": "2017-05-22"}, {"review_id": "qmsnhF7Kgk", "review": "By far, the least attentive service I've ever received at a bar or restaurant in Philadelphia. Don't waste your time or your money.", "stars": 1.0, "date": "2017-01-21"}, {"review_id": "wVKYcJNyS0", "review": "We are obsessed with this place. The bartenders are so friendly and the drinks taste amazing! The happy hour is exceptional. My friends and I have tasted many items on the menu. We love their mussels & flatbread!", "stars": 5.0, "date": "2016-11-04"}, {"review_id": "Am4C_Wv0E4", "review": "Best new bar in Philly! The menu and drinks are incredible and the staff is absolutely amazing - couldn't have had a better experience!", "stars": 5.0, "date": "2016-10-22"}], "aspect_scores": {"speed": 0.0, "food": 1.5, "value": -2.0, "ambiance": 0.0, "consistency": 0.0, "service": 1.33, "portions": 0.0, "drinks": 0.0, "quiet": 0.0, "private": 0.0, "outdoor": 0.0, "parking": 0.0, "freshness": 0.0, "vegetarian": 0.0, "staff": 0.0, "ordering": 0.0}, "gold_labels": {"C0": -1, "C1": 0, "C2": -1, "C3": 0, "C4": -1, "C5": -1, "C6": -1, "C7": -1}}
{"item_id": "aPNXGTDkf-4b", "item_name": "Craft Hall", "city": "Philadelphia", "neighborhood": "Philadelphia", "price_range": "$$", "cuisine": ["Eatertainment", "Arts & Entertainment", "Brewpubs"], "item_data": [{"review_id": "1FIFzSnwuy", "review": "First time here and it is great! Huge open space with a variation of places to sit (ie: couches, high top tables, bar). Bartenders are personable, attentive and cocktails are fantastic. Jeff made an amazing manhattan for me. Fabulous beer selection, will be back!", "stars": 5.0, "date": "2019-03-29"}, {"review_id": "_VaIq_Lw15", "review": "A-OK food and A-OK beer and quickly served (no table service but they'll run it to you). That said, good games for the kids and easy to find a spot given it's large open layout.  \n\nCorn hole is placed next to a dining table which makes that a bit crammed too.  \nAlso the Nintendo NES Classic system controllers don't work because no one thought to kid-proof them by placing them in a rubber bumper case. So those are just for show. I think I tried them all and 2 controllers worked out of the 8.", "stars": 3.0, "date": "2019-10-27"}, {"review_id": "B4L94R67ln", "review": "This place is all hype. Also I was denied entrance because I was accompanied by my service dog (with proper ADA documentation) and the manager told me I couldn't come in with a \"pet\".", "stars": 1.0, "date": "2019-04-29"}, {"review_id": "orfbowS1oR", "review": "Honestly, I can't think of a better idea for parents with young children than a playground with beer. Kids are occupied, you're relaxed, and when it comes time for food, it's easy for kids to eat. I guess you get what your pay for, because it was pricier than I thought, but still worth it. \n\nThe playground could be a smidge safer. Put railings on the ramp instead of rope. But other than that, a tremendous experience, even during an elementary school fundraiser.", "stars": 4.0, "date": "2019-03-28"}, {"review_id": "5-YovLQWy6", "review": "Awesome place for families with kids under 8.   Went there with a more than 10 adults and 5 kids. Plenty of space, good brunch menu.", "stars": 5.0, "date": "2019-04-13"}, {"review_id": "M-38wpRyPV", "review": "The BEST new addition, especially for families. Yummy food, great drinks, and an indoor playground. This has become our go-to spot on rainy days when we want to get out of the house and burn off some energy. \n\nIf you don't have kids, don't worry! There are essentially two separate areas and it's possible to go have a wonderful time without interacting with too many littles.", "stars": 5.0, "date": "2019-05-13"}, {"review_id": "On3SH1Ngwm", "review": "Fallon is a great bartender. I really appreciated her knowledge and expertise on the beer list. \nThe brunch menu is pretty great, albeit a bit on the expensive side. $17 for chix and waffles is a bit extra. However, I will say it is probably the best chix and waffles I've ever had. Also, the the poutine with eggs was also bomb.com. \nThe space is fantastic! The games are fun!", "stars": 5.0, "date": "2019-09-21"}], "aspect_scores": {"speed": 1.0, "food": 0.5, "value": -0.5, "ambiance": 0.0, "consistency": 0.0, "service": 1.0, "portions": 0.0, "drinks": 0.0, "quiet": 0.0, "private": 0.0, "outdoor": 0.0, "parking": 0.0, "freshness": 0.0, "vegetarian": 0.0, "staff": 0.0, "ordering": 0.0}, "gold_labels": {"C0": 1, "C1": -1, "C2": -1, "C3": 0, "C4": -1, "C5": -1, "C6": -1, "C7": -1}}
{"item_id": "ljxNT9p0y7YM", "item_name": "Tony's Restaurant & 3rd Street Cafe", "city": "Alton", "neighborhood": "Alton", "price_range": "$$", "cuisine": ["Restaurants", "Specialty Food", "Steakhouses"], "item_data": [{"review_id": "uiqzlDEsUN", "review": "We had been driving around for some time, on a weekday last week.  This was our last time in town, as we had sold our home in Alton.  So, after going to 3 different restaurants and finding that they are closed for various reasons, we decided we would come here.  WOW,  Seriously, everything happens for a reason, and WOW.   We were maybe one of the first patrons in the restaurant upon opening.  The ambiance is lovely.  We were greeted warmly initially, and the warmness continued throughout our visit.  As I said prior, the ambiance is lovely, the decor is SO just want to take it home.  The service was impeccable, our waitress was attentive, friendly, knowledgeable, and smiley.  OMG. The food.  THE FOOD!!!!  We had their summer special .  Holy COW, were they fantastic!  Entrees were   seafood shrimp Alfredo and our friend and I had the steak.  Honestly, you cannot go wrong with anything that you order from Tony's.  Top notch, old school dining experience, which is RARE.", "stars": 5.0, "date": "2018-07-17"}, {"review_id": "Cux77S3U0D", "review": "This place has gone so far downhill it's not even funny. We ordered stuffed mushrooms which were good. I ordered a $35 pepperloin with white pasta and my husband ordered bacon artichoke white pasta.  Well folks it was disgusting!!!  With a capital D. The white pasta tastes like pasta and if my husband didn't have bacon in his it would have had no taste what so ever. I got the 12 oz pepperloin medium with garlic butter. When I got this $35 steak it was well done no garlic butter and no peppercorns. So I cut into it two times thinking maybe I am missing the pink somewhere... nope well done and the edges were saw dust. Sent it back the waitress brings back the SAME steak smothered in butter.  R u kidding me!!  How do u make a $35 well done steak go back to medium with butter??  They r ignorant and the food is worse  save your money and go to Max's time out. The food is great and a third of the price. I will NEVER go back and I will be telling everyone I know how this place has slipped and is horrible. Thanks Tony's I saved me $35 dollars!!!", "stars": 1.0, "date": "2017-05-14"}, {"review_id": "U02oHFPjUl", "review": "Good resturant that I frequent.  Chicken Kabobs and rice is always good.  Portions aren't huge, but I didn't order any pasta.  Pasta orders get large -and- they are also tasty.  They have a 20 oz steak but I haven't ordered it yet.  I think that there should be two of me to order a 20 oz steak.  Well, pretty soon now.", "stars": 4.0, "date": "2012-09-15"}, {"review_id": "-G1BzFo74c", "review": "I was born and raised in Alton and during high school, Tony's was the 'go to' place for the greatest pizza ever.   I don't live in Alton now and just visit a couple times a year.  Last weekend, 6 of us went to Tony's for dinner in the bar.  My 'local' friends, tried to suggest other places, but I was determined to go.  Since it was Sunday, the restaurant had a great pasta special--salad, pasta and glass of wine for $10.  The ladies in our group got the special.  The guys--one ordered a pizza, another wanted the portobello mushroom sandwich, and the other guy got a sandwich as well.  One of the guys also ordered a beer--from the list located on the wall.  The waitress comes back and first tells one guy- they are out of mushrooms, so he ordered another sandwich, the next guy was told they were out of the beer he ordered, and finally, the guy who ordered pizza was told, they were out of hamburger, so they could not make him the pizza with that topping!    Now how can a restaurant run out of hamburger!  And why was the beer they were out of removed from the chalk board sign?   Anyway, We plan another trip back next month, and I will not be returning.", "stars": 2.0, "date": "2016-09-09"}, {"review_id": "rPbXR2UTDg", "review": "Tony's has a nice ambiance. The food was good and plentiful. However, the server was not the best. As minute of a detail as it sounds like, there were no bread plates provided when bread was served. This was irritating as I had nowhere to butter my bread, place it when I wasn't eating it, and the crumbs fell all over the table. Other than that, it was an alright dinner.", "stars": 3.0, "date": "2011-12-19"}, {"review_id": "xccNeGvVim", "review": "Ok, so Tony's been on the rotation and I'd actually call it one my haunts in Alton, IL.\n\nGreat food, but they are not open on Mondays, but come to think of it most spots downtown are closed on Mondays.  yeah, Squirrel I know.. back to Tony's.\n\nPizza is delectable if your into a sweet pizza sauce. They have this all meat pizza that will clog the arteries but makes you want more.\n\nThey have a great happy hour and weekly specials that change and keep you coming back.  Wait staff is good as I had many a conversation with the bar keep. \n\nI recommend, either in the bar, a special intimate dinner, and they just set up a party room which looks all kinds of classy.", "stars": 5.0, "date": "2017-05-18"}, {"review_id": "mOS3wRwsup", "review": "Had dinner there on Saturday night.  Reservations were at 6:30 PM, we got there at 6:20 checked in with the hostess and didn't get seated until 7:00 because we were forgotten about.  Sat at the table for 15 minutes before our waitress showed up, sat another 10 minutes until she brought our drinks.  She finally took our order then came back almost 30 minutes later to ask my date what temp he wanted his steak because she forgot to write it down.  So for the past 30 minutes I have no idea what she was doing, obviously not putting our order into the kitchen!  We received our salads 20-25 minutes after she got the temperature order, 1 hour sitting at that table without ANY food and with empty glasses because she didn't refill them-except for the cold, dry, yucky bread.  Once dinner was received I was SOOO disappointed, It was not as described in the menu, instead of sliced chicken from the description it was diced into small pieces and very dry.  I had maybe 3 bites and I was done!  Didn't even take it home.  Was never asked if everything was good by the waitress once.\nI will never go back.", "stars": 1.0, "date": "2012-12-10"}, {"review_id": "buk2P7ntdM", "review": "ULTIMATE POTATO BURGER\n(2) 1/2 pound patties topped with Applewood Smoked Bacon, Potatoes and melted cheese - $11.99\n\nIf you consider yourself anything of a Foodie, you MUST try this one out. Better yet, let it try you out, because it's that big. Now I have a killer appetite; however, through the words of Adam Richman, \"Food Won\"! This burger is absolutely absurd (In a good way, that is)! From the Patties, to the Smashed Potatoes and Cheesy Goodness, to the Applewood Smoked Bacon, this will sure test your taste buds. If you're not in it for a burger, be sure to check out Tony's Pizza's or his Signature Tenderloin. You will not walk away hungry or displeased!\n\nAs far as location and ambiance goes, it couldn't be better. Tony's is located in Downtown Alton, which is a quiet little town on the Mississippi, about 30 minutes from St Louis. If you want a piece of history, you can get it here. Being in business since 1954, their dining room will draw you in with it's deep colored walls, pressed tin ceiling, and the amber Tiffany lamps adding the perfect glow over the cozy private booths. And if that's too snazzy, check out their Third Street Cafe, a 75 seat Prohibition bar with a charming sidewalk cafe.", "stars": 4.0, "date": "2015-04-04"}, {"review_id": "ELasllo1tb", "review": "Been here twice....first time was Valentine's Day and food was horrible and I never got my appetizer. We figured they was totally packed and overwhelmed so we decided to try again this time on our anniversary. Big mistake! Horrible food again. I got the Sour cream and chive chicken. Made with mostly heavy cream and very very little sour cream and very few chives. The chicken was small square chunks that tasted pre cooked and was probably the chicken used in salads that they threw in to make it quick. Wife's lasagna wasn't anything to write home about either.", "stars": 2.0, "date": "2015-05-04"}, {"review_id": "iqSvEJmWQE", "review": "I was invited to go to Tony's with boss and board of directors. They have 30 beers of tap, which is amazing. I got a nice glass of moscato. Our party was ushered to our own private room, we had two servers which means we should not have had to wait, but we did but they did have three other parties I had one of the specials Italian Beef served on a bed of garlic mashed potatoes. I was not offered a salad or any other vegetable, but it was delicious and filling. Definitely a stick to your ribs meal. Nice food, but it is not a place that I would add to my list of places that I need to go to again.", "stars": 3.0, "date": "2015-09-27"}, {"review_id": "iYHgVeCr5x", "review": "BEST. STEAK. EVER.  We drive an hour for the peppercorn tenderloin. It's fabulous....everything about it. The house dressing is delicious. And the fried artichoke hearts with butter dipping sauce....amazing.  You can't go wrong.", "stars": 5.0, "date": "2016-04-30"}, {"review_id": "GiA-QfPA2U", "review": "My boyfriend and I had eaten at Tony's once before and it was ok so tried it again the other night.  They get two stars because the salad was ok. I ordered the pepper loin kabob, thinking it was just a smaller potion of their pepper loin steak. What I got was several pieces of almost sour tasting gristly meat sitting in grease. My steak fries came about 5 minutes later. My boyfriend ordered the fried chicken. Ok but nothing special. The zucchini side was actually fried frozen breaded.  Service was mediocre. We were really disappointed. Had hoped to find a nice restaurant in Alton, but we won't be back.", "stars": 1.0, "date": "2013-05-16"}], "aspect_scores": {"speed": 0.0, "food": 0.44, "value": 0.0, "ambiance": 0.0, "consistency": 0.0, "service": 1.0, "portions": 1.0, "drinks": 0.0, "quiet": 2.0, "private": 0.0, "outdoor": 0.0, "parking": 0.0, "freshness": 0.0, "vegetarian": 0.0, "staff": 0.0, "ordering": 0.0}, "gold_labels": {"C0": -1, "C1": -1, "C2": -1, "C3": 0, "C4": -1, "C5": -1, "C6": -1, "C7": -1}}
{"item_id": "wghnIlMb_i5U", "item_name": "China Dragon Restaurant", "city": "Tucson", "neighborhood": "Tucson", "price_range": "$$", "cuisine": ["Restaurants", "Chinese"], "item_data": [{"review_id": "Q8k6bndVPP", "review": "Food used to great years ago but getting really chintzy.  Beef with broccoli, thin tough pieces of beef, six slices covered in veggies.  Not many people, and seeing dirty aqarium while eating not indusive to fine dining,", "stars": 2.0, "date": "2016-02-23"}, {"review_id": "vKQdw2cgHs", "review": "I really enjoyed my BBQ pork chow mein. The service was good and everyone in my party enjoyed their meal.", "stars": 4.0, "date": "2017-07-19"}, {"review_id": "jYUhqcQ4T_", "review": "Love this place! I have been going here since a little girl, and will continue to go there. Best Chinese food in Tucson.  The owners Billy and Ellie are personable, and they remember who you are.  Staff is wonderful, everything on the menu is delicious.  Definitely a great place to go :)", "stars": 5.0, "date": "2011-05-02"}, {"review_id": "SKY_UwT57c", "review": "Food was very good until I found a wasp in my twice cooked pork. I was enjoying my food very much until I found this and I'm not coming back. I would think to find a hair but a wasp? Please make sure this doesn't happen to anyone else!", "stars": 1.0, "date": "2017-04-10"}, {"review_id": "Xx42zaXUP3", "review": "not many chinese restaurants in area\nlove their buffet\ncant eat buffets more than once a month", "stars": 3.0, "date": "2018-04-17"}, {"review_id": "4LuT9_uKT-", "review": "I called in an order for pickup and for $30 got a lot of food. Order was accurate and ready right away. It wasn't the best Chinese food ever, but it wasn't bad. I'd definitely order again.", "stars": 4.0, "date": "2017-11-08"}, {"review_id": "4clZKuxpxB", "review": "Highly recommend this place for Chinese! Food is always fresh, service is fast and the prices are great!!", "stars": 5.0, "date": "2016-06-26"}, {"review_id": "hNU_vJiUoz", "review": "The orange chicken had bones in it and was almost too thick to chew. Waitress brought our food and didn't see once after. No refills on our drinks. We had to physically hunt someone down to give us the check. Never again.", "stars": 1.0, "date": "2014-04-04"}, {"review_id": "2Ux44iq9-w", "review": "It's been our favorite Chinese restaurant for 18+ years. Cashew Chicken and Chicken Chow Mein Crispy are both outstanding. The Lemon Chicken and Orange Chicken (ask for the sauces on-the-side) are both very, very good. On any of their spicy dishes you can ask them to spice it to your heat preference/tolerance, so you everyone can enjoy their meal.", "stars": 4.0, "date": "2017-08-11"}, {"review_id": "nf3YSr5uEm", "review": "This place is on my way home. I can call while in traffic, then pick up. \nMy orders are always accurate and fresh. I'm not cheap and will pay good money $$ for good food. This place is worth the price. The staff is nice and pleasant. They always make recommendations for the next visit.", "stars": 5.0, "date": "2018-02-06"}, {"review_id": "Mf_hInjrG1", "review": "Been coming here for picks for years and this spot has some of the best chicken fried rice on this side of town. Food is always already in less then 15mins, you can't beat that services and the menu is got tons of great options to choose from. \n\nIf you're on the southwest side of town and looking for some Chinese give them a shot.", "stars": 4.0, "date": "2017-06-14"}], "aspect_scores": {"speed": 1.5, "food": 1.17, "value": 1.0, "ambiance": -0.5, "consistency": 0.0, "service": 0.0, "portions": 0.0, "drinks": 0.0, "quiet": 0.0, "private": 0.0, "outdoor": 0.0, "parking": 0.0, "freshness": 0.0, "vegetarian": 0.0, "staff": 0.0, "ordering": 0.0}, "gold_labels": {"C0": 1, "C1": 0, "C2": 1, "C3": -1, "C4": 0, "C5": -1, "C6": 0, "C7": 0}}
{"item_id": "lk9IwjZXqUMq", "item_name": "Caviar & Bananas", "city": "Nashville", "neighborhood": "Nashville", "price_range": "$$", "cuisine": ["Coffee & Tea", "Restaurants", "Wine Bars"], "item_data": [{"review_id": "NpZje24sgY", "review": "Awful business model it took forever to even figure out where to order. on top of that the workers actually are not professional at all. on top of THAT my other half sandwhich didn't even have sausage covering even half of the bread. easily worst place i've been in a while", "stars": 1.0, "date": "2017-12-29"}, {"review_id": "vQxUaNanrY", "review": "Free parking garage.  Eat in grocery store or deli type restaurant....everything is by the pound.", "stars": 4.0, "date": "2017-07-08"}, {"review_id": "KbRajhI-zt", "review": "Awesome healthy food and really nice staff :) Mike went above and beyond to make sure that I got the food that I wanted. Can't thank this place enough for providing me with some greens and healthy options while visiting Nashville!", "stars": 5.0, "date": "2018-06-10"}, {"review_id": "g-i9gJnu1R", "review": "I could go broke trying everything offered in this place. It's set up like a modern day cafeteria. You can chose where you want to eat whether its a salad bar, Wine and dessert bar, sandwich counter, or glass case with numerous tasty options. I opted for the salad and it was great. You can choose from their menu or create your own. I also sat at the bar and ordered ginger tea.\nThe ambience of this place is good and makes you feel you are in a mainstream city. Definitely check it out!", "stars": 4.0, "date": "2017-10-11"}, {"review_id": "b-HgbSHWYB", "review": "Visited twice. Great decor and vibe, and the quality of food to match. Had the Baja Salad with grilled shrimp. Great portion size for the cost. Only problem is that the shrimp on the salad were so freshly grilled that one wasn't fully cooked. Excellent selection of sparkling waters and sodas in the cooler as well. Quick check out process and good service overall. I'm glad they are here and will visit again!", "stars": 4.0, "date": "2017-07-31"}, {"review_id": "TpPPH0XA5H", "review": "Enjoyed a nice Sunday brunch with a tall caramel latte.  Jalapeno cheddar bacon grits where on point.", "stars": 4.0, "date": "2018-02-11"}, {"review_id": "76Q3ylJbYt", "review": "Perfect lunch place and great for vegetarians because there is a build-your-own salad and sandwich bar. I created a veggie sandwich which was very tasty. Since it's also a market there is a large selection of drinks and snacks.", "stars": 4.0, "date": "2017-09-10"}], "aspect_scores": {"speed": 1.0, "food": 0.25, "value": 0.0, "ambiance": 0.0, "consistency": 0.0, "service": 1.33, "portions": 0.0, "drinks": 0.0, "quiet": 0.0, "private": 0.0, "outdoor": 0.0, "parking": 0.0, "freshness": 0.0, "vegetarian": 0.0, "staff": 0.0, "ordering": 0.0}, "gold_labels": {"C0": 0, "C1": -1, "C2": -1, "C3": 0, "C4": -1, "C5": -1, "C6": -1, "C7": -1}}
{"item_id": "uI9XODGY_2_i", "item_name": "Roman Forum", "city": "Tampa", "neighborhood": "Tampa", "price_range": "$$", "cuisine": ["Restaurants", "American (New)", "Italian"], "item_data": [{"review_id": "u10Dg1r61g", "review": "I guess I should have ordered the Pizza, because I cannot believe how bland the pasta was. Save your money and make some pasta at home, even Weight Watchers Smart ones has more flavor with their pasta dishes. I will say the waitress was very polite as was the manager, but that did not make up for the lousy food. No wonder the place was empty. Too bad, because I would rather support a locally owned business over a chain any day.", "stars": 1.0, "date": "2014-04-23"}, {"review_id": "wX1SJEv4dc", "review": "Had dinner here last week and I was very impressed. The restaurant boasts everything is made from scratch and it certainly tasted that way. My chicken dish was very nicely prepared and my wife's eggplant Parmesan was very good as well. The playroom they have for the kids is a very very nice bonus for any parent.", "stars": 5.0, "date": "2014-12-01"}, {"review_id": "iWLZU0OXcP", "review": "Okay so the exterior looks a little wild but this place is great. Everything is delicious, try the fried tomato skin appetizer! The best part is the large kids play area...you can enjoy dinner (and wine!) while your kids are entertained. Definitely a hidden Tampa gem.", "stars": 4.0, "date": "2014-03-21"}, {"review_id": "4CNyaZGiIV", "review": "I'm really surprised by the negative reviews of this restaurant. Every time I try it, the service is friendly, attentive and the food is very good. They have a way with chicken.", "stars": 5.0, "date": "2014-09-30"}, {"review_id": "zyYhwdGr90", "review": "Everything I tasted was good!!  We had the ricotta rounds & tried a sample of the house pizza.  My friend got the manicotti - which she said was a little too cheesy,  but my chicken with veggies was outstanding! !  Highly recommend this place.  Reasonable prices and great food :)", "stars": 5.0, "date": "2013-12-28"}, {"review_id": "ePzaysiJ1h", "review": "Another nice visit with great service, an involved manager who remembers you and nice food. Keep up the good work!", "stars": 5.0, "date": "2014-05-06"}], "aspect_scores": {"speed": 0.0, "food": 0.75, "value": 1.0, "ambiance": 0.0, "consistency": 0.0, "service": 1.0, "portions": 0.0, "drinks": 0.0, "quiet": 0.0, "private": 0.0, "outdoor": 0.0, "parking": 0.0, "freshness": 0.0, "vegetarian": 0.0, "staff": 0.0, "ordering": 0.0}, "gold_labels": {"C0": -1, "C1": -1, "C2": -1, "C3": 0, "C4": -1, "C5": -1, "C6": -1, "C7": 0}}
{"item_id": "JgpnXv_0XhV3", "item_name": "Joe's Pizza", "city": "Tampa", "neighborhood": "Tampa", "price_range": "$$", "cuisine": ["Restaurants", "Pizza"], "item_data": [{"review_id": "iqYbzfUYwg", "review": "Great local pizza with awesome owner and employees. Authentic NY style pizza at a great price. They also have great sandwiches especially the pulled pork. Open late for midnight snacks and have great lunch time specials. If you work around Westshore Joes pizza is a great spot to grab a quick bite to eat.", "stars": 4.0, "date": "2016-05-19"}, {"review_id": "o7gN8bx0qa", "review": "Yes, yes, yes.  I was on my way to work the other evening, the previous day I had stopped at Wendy's. I was about to stop there again, then I saw the sign for Joe's Pizza, and it said that you can get it by the slice.  So I stopped and ordered 2 slices. I was like, WOW, THIS IS WHAT I BEEN LOOKING FOR.  Not being from the tampa bay area, I had been looking for this type of pizza. It was so good, I stopped by there the next day. I will definitely be back as a regular.", "stars": 5.0, "date": "2016-06-24"}, {"review_id": "cFrbcMN16w", "review": "This is not New York pizza it's thin crust andhorrible the service was horrendous and that's all", "stars": 2.0, "date": "2018-05-03"}, {"review_id": "lgCDQrjybD", "review": "I've been visiting this pizza place since I was a kid, and the quality and taste are the same time after time. 5* on their consistency. Customer service could be touched up on, maybe a little more patience and more enthusiasm and Then I'd rate a 5 star, everything else was lovely though", "stars": 4.0, "date": "2018-01-23"}, {"review_id": "JYeuawk5Om", "review": "They sadly closed today at 4pm. Rip to Tampa's best ny style pizza. Hopefully someone can take the recipes and open a new spot", "stars": 5.0, "date": "2018-05-22"}, {"review_id": "5T7wKlCJJO", "review": "What you have here  is a transplanted NY pizza joint. Good pizza, nice lunch specials. Thin New York style, foldable slices. What else do you want.", "stars": 4.0, "date": "2014-03-01"}, {"review_id": "GFrKzu8bNd", "review": "In town again for work and made sure I saved my appetite for the Philly Delish! Love this place and wish there was one near home.", "stars": 5.0, "date": "2015-11-21"}, {"review_id": "eZIMUXBsWi", "review": "Me and my girls stopped at Joe's Pizza around midnight on a Sat night and were not disappointed.  The Pizza is tasty with a great sauce and the service is great.  Eddie hooked up our pizza with expertise and a smile.  I seriously recommend trying this spot out.", "stars": 4.0, "date": "2014-09-14"}, {"review_id": "Xq4GuOGvAz", "review": "This is the number 1 pizza restaurant in the Tampa Bay area. If you want great tasting pizza then go to Joe's Pizza. Don't waste your time with anyone else. At Joe's Pizza you can order up to a 28 inch pizza. I normally get a 24\" cheese pizza. \n\nThis is TOP SHELF in my book. When I am on the road and I have customers in the car I recommend this place over anyone else. The next time you want pizza go to Joe's Pizza you won't be disappointed. Tell them that DAN THE CAB MAN sent you.", "stars": 5.0, "date": "2016-02-03"}, {"review_id": "xIE4QcPZmZ", "review": "I ordered 3 pizza's for an office event yesterday.  We had a pepperoni, a sausage, and a meatball with ricotta.  Our team really enjoyed all 3 pizza's.  We ordered through Uber Eats and they arrived in a timely manner, were hot and fresh.  Overall a great experience.  We ordered from a competitor too and that experience didn't go so well.  We will be ordering more from Joe's in the future.", "stars": 4.0, "date": "2017-06-23"}, {"review_id": "ShwIctE0fL", "review": "Went to Joe's after drinking some beer at nearby Cigar City Brewery. I ordered two slices and a drink for $7 including tax. Great pizza, friendly service, and fun enjoyed by all", "stars": 4.0, "date": "2015-06-28"}], "aspect_scores": {"speed": 1.0, "food": 0.57, "value": 0.0, "ambiance": 0.0, "consistency": 0.0, "service": 0.0, "portions": 0.0, "drinks": 0.0, "quiet": 0.0, "private": 0.0, "outdoor": 0.0, "parking": 0.0, "freshness": 0.0, "vegetarian": 0.0, "staff": 0.0, "ordering": 0.0}, "gold_labels": {"C0": 1, "C1": -1, "C2": -1, "C3": -1, "C4": -1, "C5": -1, "C6": -1, "C7": -1}}
{"item_id": "seKihQKpGGnC", "item_name": "Twin Peaks", "city": "Indianapolis", "neighborhood": "Indianapolis", "price_range": "$$", "cuisine": ["Sports Bars", "American (New)", "American (Traditional)"], "item_data": [{"review_id": "WwQ6Yo3WTe", "review": "First time diner and I will definitely be back.  The food was awesome.  Best fried cheese and wings I've had in a while.  Shelby was our server.  She did a great job.  I'm looking forward to coming back next week.  I can't believe on Thursday tall PBR drafts are 2.50.", "stars": 5.0, "date": "2015-08-07"}, {"review_id": "w4jpw2MZTu", "review": "Food was ok. We were there to watch playoff hockey. Waitress was horribly inattentive. Never did bring water even though I asked for it three times. She hardly stayed at the table long enough for us to even ask for appetizer and had to flag her down multiple times for everything else that evening.", "stars": 2.0, "date": "2017-05-26"}, {"review_id": "GNREgOUkqc", "review": "Better than Hooters for both food and scenery.  The servers here are certainly friendlier.\n\nThe food is okay, basically pub food.  The menu is small, but who comes to a restaurant like this looking for an expansive menu?\n\nWe've been in a couple of times for lunch.  They usually are seating immediately.\n\nThe biggest downside is the parking lot.  Some of those potholes could swallow a car.", "stars": 4.0, "date": "2015-03-19"}, {"review_id": "xYTuD8n4w2", "review": "Probably the worst service ever... Was here on a Sunday evening with a group of 4 to get drinks and a couple apps.  My friend was served the wrong beer twice.  My drink took so long that the ice was melted by the time I got it.  I asked for a straw for my water and my server said \"there's no water in there.\" No lie. Manager tried to fix the situation and she was polite and slightly more helpful.  The food we did receive was tasty, if cold. At least it was an entertaining night!", "stars": 1.0, "date": "2015-08-31"}, {"review_id": "zfsS62p3Ji", "review": "Good food but location is difficult to get in and out of. The scenery is ok but not as nice as other locations.", "stars": 3.0, "date": "2015-06-11"}, {"review_id": "Q5OHXHbCWN", "review": "The Pecks Smapler is a nice choice with boneless wing, mozzarella bites and fried pickles are a good starter or meal depending one your appetite. \n\nThe spicy Thai wings are a good side item to go with the sampler", "stars": 5.0, "date": "2017-06-18"}, {"review_id": "qUhB-W4h-7", "review": "My burger was extremely greasy and my fries were very cold. The waitress was also not helpful to me and my fiancés friends. She seemed preoccupied talking to other waitresses and the hostess.", "stars": 2.0, "date": "2016-03-20"}, {"review_id": "9haQ8-0Y_x", "review": "Good beer selection, good food, nice servers, poor execution. Last two visits, two order problems. First, completely wrong order brought to table. They brought our actual order soon after, and gave us the wrong order at no charge. Wasn't bad. Second time, 50 min wait for food. Lost order. Food comped. Not a good trend for what should be SOP. At least they make good on their errors", "stars": 3.0, "date": "2016-01-30"}, {"review_id": "WiUUlrps48", "review": "I had my fantasy football draft here.  The staff took great care of us.  Jessica was our server.  She absolutely rocked.  Paul Gellar was the manager on duty.  He was extremely nice and polite.  Paul even helped set up the room for my fantasy football draft.    The food was top notch.  Most of the guys in my league have never been to Twin Peaks.  They told me that they will become regulars because of the food and service.  I'm looking forward to visiting Twin Peaks again soon.", "stars": 5.0, "date": "2015-09-01"}, {"review_id": "nvB6Lz84W5", "review": "Our server was about as bad as it gets, bartenders even worse. Its new so they have to ween out there staff but I was pretty disappointed, 1 highlight was the pretzel w cheese, but its pretty hard to screw that up.", "stars": 2.0, "date": "2015-01-21"}], "aspect_scores": {"speed": 2.0, "food": 1.0, "value": 0.0, "ambiance": 0.0, "consistency": 0.0, "service": 1.0, "portions": 0.0, "drinks": 0.0, "quiet": 0.0, "private": 0.0, "outdoor": 0.0, "parking": 2.0, "freshness": 0.0, "vegetarian": 0.0, "staff": 1.0, "ordering": 0.0}, "gold_labels": {"C0": 1, "C1": 0, "C2": -1, "C3": 0, "C4": -1, "C5": -1, "C6": -1, "C7": -1}}
{"item_id": "qfWJmJ0g96eM", "item_name": "Doc Magrogan's Oyster House - West Chester", "city": "West Chester", "neighborhood": "West Chester", "price_range": "$$", "cuisine": ["Seafood", "Restaurants", "Bars"], "item_data": [{"review_id": "w4LMSALcrF", "review": "My first visit and my last. Just spent $21.00 for fried oysters and fries. Fries were the best part of the meal (ketchup was okay). They presented 8 little balls of fried crust covering the smallest, mushy oysters. I eat 3 hoping it would get better but the 4th was mush and foul.\nI told the waiter and he said he was sorry. I paid the bill. Lesson learned but it was not cheap.", "stars": 1.0, "date": "2015-07-28"}, {"review_id": "JXfZSE2-An", "review": "Had a great time,2nd floor,great food,Kelsey is excellent, made Valentines all worth it,sharing the love! Thanks", "stars": 5.0, "date": "2016-02-15"}, {"review_id": "vksi5loNdz", "review": "Went here for my birthday last year and it was pretty good.  I'm a big fan of oysters and I admit they we're better than I thought.  They didn't oversalt the shooters which some places tend to do from time to time.  For my entree i had salmon which was made just right and not too dry.  Definitely want to get back for some crab legs soon.", "stars": 3.0, "date": "2009-03-07"}, {"review_id": "gXn7vpLPIB", "review": "Doc's does AYCE Crabs very well!  I've been there many times before, but last night was exceptional.  They're a few bucks more this year ($25), but never once was my plate empty, and the crabs were LARGE, and cooked perfectly.  $3 Hop Devil's were great too!  Somehow I even managed room for dessert and the $3 Peanut butter Cup mousse was delicious!  Throw in a very nice & cheerful waitress and it was a great experience!", "stars": 4.0, "date": "2012-05-31"}, {"review_id": "vjjbBHyh9X", "review": "Had take out--ordered the pan seared chicken. It was very rubbery, hard, dry.  The sides were so so.  My husband had salmon with crab hash that was so so.  Quality definatlely going down.  Its a shame because we have a huge gift card here from their black Friday half price sale.", "stars": 2.0, "date": "2015-10-08"}, {"review_id": "dl6pWj57YD", "review": "Watch out for credit card fraud. Eat dinner last Thursday nite service was good tipped 20% which is my standard if service is good, they added an additional 5$ to the tip. Over priced ok food! \nOh and another thing there grey goose is not!! Will never go back!!!", "stars": 1.0, "date": "2015-02-03"}, {"review_id": "auq61gxfUx", "review": "Loved the atmosphere, lobster roll was delicious, service was good. The PEI oysters were microscopic, so we weren't charged for them. The food is pricey but I would back again.", "stars": 4.0, "date": "2015-10-18"}, {"review_id": "nEWG8PaZ9t", "review": "Disappointing. We asked the bar tender if we could get fried oysters, which are not on the menu, he said no problem. We asked how many, he said 4 per order so we asked for two orders. When the oysters came out there we only six not eight. They were nothing but breading. We couldn't even find the oysters in two of the lumps of fried breading. We ate two and sent the remaining dough back. They did not charge us for the order.", "stars": 1.0, "date": "2015-11-20"}], "aspect_scores": {"speed": 0.0, "food": 0.75, "value": 0.33, "ambiance": 0.0, "consistency": 0.0, "service": 0.0, "portions": 0.0, "drinks": 0.0, "quiet": 0.0, "private": 0.0, "outdoor": 0.0, "parking": 0.0, "freshness": 0.0, "vegetarian": 0.0, "staff": 0.0, "ordering": 0.0}, "gold_labels": {"C0": -1, "C1": -1, "C2": -1, "C3": -1, "C4": -1, "C5": -1, "C6": -1, "C7": -1}}
{"item_id": "8rb-3VYXE37I", "item_name": "Sharky's Sports Bar & Grill", "city": "Williamstown", "neighborhood": "Williamstown", "price_range": "$$", "cuisine": ["American (Traditional)", "Bars", "Nightlife"], "item_data": [{"review_id": "CVVvBWZB-0", "review": "This place is a dump. Its dirty and the bartenders are NASTY. Much better option down the road at Racks or House of Brews. Don't believe me? Give it a try. Worst bartenders I've ever come across", "stars": 1.0, "date": "2018-07-17"}, {"review_id": "wzJXQK5mWK", "review": "Great wings, crispy and meaty.  Upstairs is for the younger crowd, downstairs for locals.  2 pool tables and American dart boards.", "stars": 3.0, "date": "2015-10-09"}, {"review_id": "uz1kspDlBh", "review": "My favorite dive bar around town. Betty, the bartender, upstairs, is the best.", "stars": 5.0, "date": "2011-09-04"}, {"review_id": "6mapAcuBws", "review": "Went here on a Saturday night with three friends. The beer-gut bouncer was rude and creepy towards two girls in my group. The downstairs bar was almost empty and the upstairs was filled. Understaffed, crappy music, and long wait times made us leave early. Only plus was finding a dollar some drunk had left in the juke box... Not worth the time", "stars": 2.0, "date": "2015-05-10"}, {"review_id": "je4j303DxC", "review": "I would go lower than one star if I could. They don't clean anything in there. I went there and had three drinks and was throwing up for 7 hours. They don't clean their soda lines and I doubt they clean much else. If they don't care about the health of their customers they don't deserve to even be open. I will never be back and I hope they go out of business and are replaced by someone who actually cares.", "stars": 1.0, "date": "2016-12-28"}, {"review_id": "FfAIAUxsq8", "review": "This is definitely a locals' bar. It was my second time there and we went for a surprise party. The bartender, Betty... AWESOME and so creative! She makes awesome drinks and shots! Everything was reasonable pricing and we enjoyed it there. Loved their wings/pizza rolls. Delish! My friends didn't love this place, but I think it's who you're with to really enjoy to place. Once you get a few Cotton Candy or Dirty Girl Scout shots in, you're having the time of your life!", "stars": 3.0, "date": "2015-08-11"}, {"review_id": "OdmlViTePM", "review": "If 0 stars were possible i would leave it.what a scummy place.the so called bartenders are a joke .very rude the food sucks the owner is a piece of trash. The fatboy bouncer is a joke .Hey fat boy your not tough or scary like you portray yourself.Do not eat at this scumbag so called bar.", "stars": 1.0, "date": "2016-08-21"}, {"review_id": "bi2Fx5cb2E", "review": "We went here after a wedding. It is a terrible dive. It took a while for our sever to come over. Maybe it was because they are not used to a crowd. When the server took our order, she seemed a bit bothered. When they finally came out, the fries were over cooked. On the plus side the draft selection was ok for the area. The wings were just ok. If you are stuck going after a wedding it's fine. I guess there are not many choices in the area. I would never choose to go here.", "stars": 1.0, "date": "2015-04-25"}], "aspect_scores": {"speed": -1.0, "food": 0.0, "value": 1.0, "ambiance": -2.0, "consistency": 0.0, "service": 0.0, "portions": 0.0, "drinks": 0.0, "quiet": 0.0, "private": 0.0, "outdoor": 0.0, "parking": 0.0, "freshness": 0.0, "vegetarian": 0.0, "staff": 0.0, "ordering": 0.0}, "gold_labels": {"C0": -1, "C1": -1, "C2": -1, "C3": -1, "C4": -1, "C5": -1, "C6": -1, "C7": 0}}
{"item_id": "aCDY7vXYMs54", "item_name": "39 North Taproom & Grill", "city": "Glenolden", "neighborhood": "Glenolden", "price_range": "$$", "cuisine": ["American (Traditional)", "Sports Bars", "Restaurants"], "item_data": [{"review_id": "JiJ3I9IZM0", "review": "This place is the best restaurant around Glenolden! The food is amazing because they have professional chefs in there and the service is wonderful 5 stars.", "stars": 5.0, "date": "2018-04-07"}, {"review_id": "2mGU3IYFtA", "review": "Bad burger, pieces of bone , not tasty. Great Service.", "stars": 2.0, "date": "2021-03-27"}, {"review_id": "deKWiFOVCp", "review": "Pleased with our experience. Good food reasonably priced. Friendly service and live music was excellent. We'll be back.", "stars": 4.0, "date": "2019-10-26"}, {"review_id": "ZMBwbxD21a", "review": "Really great food and the watress was really friendly. Great Beer on tap....we arrived at 7 p.m and they had live music until late.... At least until around midnight when we left. The Bartender was also super friendly and had great conversations with us.", "stars": 5.0, "date": "2019-03-23"}, {"review_id": "x-luUnfPah", "review": "Great crowd great service, nice shot and beer place, There food is really good too. Nice environment and they always had an outdoor section", "stars": 4.0, "date": "2020-08-12"}, {"review_id": "DCP_Mi-DWQ", "review": "Stayed at the airport and came out for the reviews. Good local old school bar and grill. What sets this apart is the service. Outstanding.", "stars": 5.0, "date": "2018-12-06"}, {"review_id": "cH3XpXfslA", "review": "Fantastic Brussels sprout.  They have a good selection of beer.  The service was excellent.", "stars": 5.0, "date": "2019-05-12"}, {"review_id": "hXUxn6iMIp", "review": "This place is an awesome spot in Glenolden! They have excellent take-out meals that have been on our regular rotation since the COVID-19 pandemic. The restaurant has designated take-out parking spots and a convenient pickup window. Great food, obtained safely :). The food quality is exceptional; and they always have great daily dinner specials.", "stars": 5.0, "date": "2020-07-31"}], "aspect_scores": {"speed": 0.0, "food": 1.25, "value": 1.0, "ambiance": 0.0, "consistency": 0.0, "service": 1.0, "portions": 0.0, "drinks": 0.0, "quiet": 0.0, "private": 0.0, "outdoor": 0.0, "parking": 0.0, "freshness": 0.0, "vegetarian": 0.0, "staff": 0.0, "ordering": 0.0}, "gold_labels": {"C0": -1, "C1": 0, "C2": 0, "C3": 0, "C4": -1, "C5": -1, "C6": 0, "C7": 0}}
{"item_id": "x9K0RfZaT_zl", "item_name": "Gavi Italian Restaurant", "city": "Tucson", "neighborhood": "Tucson", "price_range": "$$", "cuisine": ["Italian", "Restaurants"], "item_data": [{"review_id": "oWo9ZJzYYQ", "review": "No unreasonable waits, great service, and their food is a decent local alternative to Italian chains.  Do not go to the other two Gavi's!  You will be disappointed.", "stars": 4.0, "date": "2005-04-03"}, {"review_id": "SIDkFdKE4c", "review": "Probably my favorite restaurant in Tucson.  The peppers, pasta and bread they give to start your dinner is amazing. I have tried numerous things there and everything is always excellent.  You can't go wrong with this place.  The only downside is most of the dishes are rich so either eat less or accept the calories with a smile. \n\nI recommend this place to everyone.  It delicious, reasonably priced and not pretentious.\n\nAlso their house salad dressing is really good.", "stars": 5.0, "date": "2009-03-08"}, {"review_id": "tjf0uwuOqG", "review": "horrible service. no  croutons on salad. no salad forks at all. overpriced slop.", "stars": 1.0, "date": "2009-04-09"}, {"review_id": "jOdWU_ZW8c", "review": "So sad to see the restaurant leave the northwest side at their Foothills Mall location. It was not the most authentic Italian food in town but I had never had a bad meal there. I absolutely loved the seafood manicotti and many other dishes from the menu. It always tasted fresh and very homemade.\n\nPlus, my husband and I got engaged there. Not the most romantic ambiance some might say but it was perfect for us. \n\nGood bye Gavi, you will be missed.", "stars": 4.0, "date": "2009-08-17"}, {"review_id": "1tjGGti1Ew", "review": "This place has been great every time I've been.  They have a huge selection of pastas (and a lot without meat, which I appreciate).  Their house salad dressing is sooo good.", "stars": 5.0, "date": "2009-03-08"}, {"review_id": "dXtjjSHtsm", "review": "Love this place.  It's hard to find because it's one of the storefronts in the Mall but it faces out towards La Cholla near the intersectin of Ina.  I haven't been to any of the other Gavis, but this one is cool.  Great, great pastas...and believe it or not the best French Toast I've had for breakfast (yep--all three meals).  Amazing, amazing wine list organized by the region and appellation within Italy.  Did I mention the pasta's were great? Love this place! ...I know, I said this already.", "stars": 4.0, "date": "2007-02-22"}, {"review_id": "-VzyhVaexy", "review": "Italian food in a soccer setting.. and I am not talking about just any italian food. This is my favorite Italian restaurant. And located right next to Thunder Canyon Brewery- as you can see the possibilities are endless.. as in endless drinks and then the food.. oh, so good! The only flip side to this restaurant is that it is a little on the expensive side.. but the food, in my opinion is totally worth it!", "stars": 5.0, "date": "2005-04-13"}], "aspect_scores": {"speed": 1.0, "food": 0.57, "value": 0.25, "ambiance": 2.0, "consistency": 0.0, "service": 0.0, "portions": 0.0, "drinks": 2.0, "quiet": 0.0, "private": 0.0, "outdoor": 0.0, "parking": 0.0, "freshness": 0.0, "vegetarian": 0.0, "staff": 0.0, "ordering": 0.0}, "gold_labels": {"C0": 1, "C1": -1, "C2": -1, "C3": -1, "C4": -1, "C5": -1, "C6": -1, "C7": -1}}
{"item_id": "1MeIwdbTnZOB", "item_name": "Ricardo's Italian Cafe", "city": "Saint Louis", "neighborhood": "Saint Louis", "price_range": "$$", "cuisine": ["American (New)", "Restaurants", "Cafes"], "item_data": [{"review_id": "-LWnlRe86V", "review": "This is my favorite neighborhood restaurant to go to. I love watching hockey or baseball in the bar while I eat. I live in south city but feel like I live in the Square as I know most of the people in the neighborhood. \n\nThe food is so delicious. I always recommend the Chicken Spedini to people who have never eaten there before. \n\nThe craft beer on tap is delicious as well.", "stars": 5.0, "date": "2015-02-19"}, {"review_id": "umkMKHuBIF", "review": "Nice ambiance. Friendly staff. \n\nI ordered Linguini Asparagi which is described as, \"Thin flat noodles in a cream sauce with freshly sliced mushrooms and asparagus.\"\n\nThe sauce was good but the rest was poor.  I may have counted 4-5 slices of mushroom and the asparagus was THIN and tough.\n\nThey need to take this off their menu.\n\nAte here again (sept2013). Review of food is the same. Expensive. Not worth the extra trip.", "stars": 3.0, "date": "2011-08-28"}, {"review_id": "_jaGumIsSL", "review": "My son and nephew had pasta--pasta carbonara and fettuccini al fredo. They loved it. My sister and I had large salads--Casear and the House. More than enough for dinner, which made for a very reasonable meal. Service was quick, the pasta came out hot, food was very tasty, and I would reecommend this for a family or for a date night.   Prices are very reasonable.", "stars": 4.0, "date": "2012-12-08"}, {"review_id": "SLn-c5zRxM", "review": "A party of 8 of us went on a Friday night and the place was empty. Food was meh; and overpriced. \n\nBut the service was awful. Our waitress seemed awkward and highly annoyed. Was always \"around\" but not helpful. And interrupted our lively and fun dinner an excessive amount of time; in a way that made everyone uncomfortable.\n\nWill not go back or recommend.", "stars": 1.0, "date": "2014-08-25"}, {"review_id": "xbbytJQe-H", "review": "I love this little Italian gem in Lafayette Square.  The atmosphere is so quaint and inviting.  They have a great menu and I've never had a bad glass of wine there.  Yum.", "stars": 5.0, "date": "2008-01-04"}, {"review_id": "LHrO8MGYGa", "review": "We came to Ricardo's on a Thursday evening and it was pretty quiet. The hostess seated us quickly but we figured that there would be problems pretty quickly when the waiter didn't come check in with us for about ten minutes. \nThe food was good. Not incredible but good sized portions and tasty but the service was terrible. The entire night was plagued by the absence of our waiter and when he did come by, he was extremely aloof.", "stars": 3.0, "date": "2014-05-27"}], "aspect_scores": {"speed": 1.0, "food": 0.67, "value": -1.0, "ambiance": 1.0, "consistency": 0.0, "service": 1.0, "portions": 0.0, "drinks": 0.0, "quiet": 0.0, "private": 0.0, "outdoor": 0.0, "parking": 0.0, "freshness": 0.0, "vegetarian": 0.0, "staff": 1.0, "ordering": 0.0}, "gold_labels": {"C0": 1, "C1": -1, "C2": -1, "C3": 0, "C4": -1, "C5": -1, "C6": -1, "C7": -1}}
{"item_id": "EuRGgOwJ0g1v", "item_name": "Crafty Crab", "city": "Fairview Heights", "neighborhood": "Fairview Heights", "price_range": "$$", "cuisine": ["Seafood", "Restaurants"], "item_data": [{"review_id": "DrWMCBMRwe", "review": "Waiter was absolutely terrible ordered our food and waited a hour and a half for it. Let our alcoholic drinks sit and water down at the bar for 20 mins. Dropped our crab at the table and before we could ask for anything he ran off. Wasn't busy at all, waitresses and waiters were standing and laughing and talking at the bar no one was helping us or anyone else, had to get up finally and pick up our own drinks from the bar Because he wouldn't bring them to us.", "stars": 1.0, "date": "2021-11-06"}, {"review_id": "TYqPRl8MXN", "review": "Drinks were good. Food was good. Appetizer was mediocre. Tasted like just some generic stuff deep fried. The shrimp boil was good and the garlic butter was delicious. Good service. Would come back but skip the appetizers.", "stars": 4.0, "date": "2021-07-01"}, {"review_id": "XYZpRauYoa", "review": "Soooo good our waitress Crystal was super attentive. The shrimp were very fresh and good, crab was fantastic and can't even begin to describe the fried Oreos!", "stars": 5.0, "date": "2021-12-16"}, {"review_id": "SZVuBu0383", "review": "It held such potential, but really underdelivered.  The King crab came with 2 1/2 half legs so basically 1 leg plus a little. When confronted on if this was a pound, they doubled down on that is a pound.... My wife had the snow crab legs and they were the smallest, most anemic legs I have ever seen. Everything was overly salty and the drawn butter tasted like used frying oil. We will not be back here. We are disappointed as we were looking for a close crab place", "stars": 2.0, "date": "2021-07-23"}, {"review_id": "lmaTQWT1ON", "review": "Patricia the manager/ bartender had a bad attitude and horrible service.  The drinks were horrible. She not a good bartender at all .And we could not send them back due to there no refund policy. I have never been to any restaurant and could not send drinks back. She did offer to make us virgin drinks before we left but why would I still be charged the same price for a drink with no alcohol. Horrible service overall.", "stars": 1.0, "date": "2021-12-18"}, {"review_id": "1IppSLNcI1", "review": "The food was excellent. We had a shrimp and crab boil that was delicious and plentiful. The sauce was so good. We had wonderful oysters and great sides. The service was also very good. My only complaint is that on a Saturday night they have music, not to my liking, that is too loud and distracting. Otherwise enjoyed it and will go back.", "stars": 4.0, "date": "2022-01-03"}, {"review_id": "ELjc3t7v72", "review": "My experience at the Crafty Crab was wonderful! We came in and were seated immediately, our waiter was very kind and gave us a lot of suggestions for appetizers. We went with the crab meat fries which were delicious you all should definitely give them a try! I wish I had pictures, but I was too busy enjoying the food. \n\nDefinitely check this place out if you want a great reasonably priced seafood boil!", "stars": 5.0, "date": "2021-08-15"}, {"review_id": "BhnnHYW9AI", "review": "Ordered Togo more then once. \nService as far as Togo's great. \nOverall good. \nI'd rather go to krab kingz Delmar as I've been doing. \nIt's not worth the price you pay.", "stars": 2.0, "date": "2021-12-28"}, {"review_id": "zREwXym7Lj", "review": "This may be the most over priced food I have ever eaten. There 1/2lb and 1 lb scale is not accurate. Flavor was good but way over priced for the quantity. Also their fried oysters are breaded and frozen. I can only imagine what the raw oysters they offer would be.", "stars": 1.0, "date": "2021-12-02"}, {"review_id": "LPaJo4VU50", "review": "Everything is amazing ! Me and my friends went there yesterday night, the environment is amazing, huge TV screen and very clean, foods are very delicious and every time we need help always someone there help us, it is worth to the price ! I will come back next time!", "stars": 5.0, "date": "2021-12-01"}, {"review_id": "LtwNgthAaJ", "review": "Perfect seafood boils! Yummy sauce, great spice level, and fresh seafood. Will be going back again!!", "stars": 5.0, "date": "2021-08-19"}], "aspect_scores": {"speed": 2.0, "food": 0.62, "value": 1.0, "ambiance": 0.0, "consistency": 0.0, "service": 1.0, "portions": 0.0, "drinks": 0.0, "quiet": 0.0, "private": 0.0, "outdoor": 0.0, "parking": 0.0, "freshness": 0.0, "vegetarian": 0.0, "staff": 0.0, "ordering": 0.0}, "gold_labels": {"C0": 1, "C1": -1, "C2": -1, "C3": 0, "C4": 0, "C5": -1, "C6": -1, "C7": 0}}
{"item_id": "Dy91wdWkwtI_", "item_name": "Taqueria Los Primos", "city": "Wilmington", "neighborhood": "Wilmington", "price_range": "$$", "cuisine": ["Mexican", "Restaurants"], "item_data": [{"review_id": "f5v-FFEXa3", "review": "Are you kidding me?  Another taco emporium worthy of 5 stars in Wilmington, DE?   Your first clue is the woman hand pressing the tortillas.  The second clue would be the crates of cilantro being carried to the back while you eat. Forget english.  If you don't know spanish, point and grunt works.  I expect after your first try, you'll be back often enough to pick up some restaurant-specific lingo.\n\nAfter the twice a week jaunts make you a bit taco jaded, try a torta.  YUM YUM YUM.", "stars": 5.0, "date": "2012-03-31"}, {"review_id": "H702bwF8Bg", "review": "Good place for hangover ,not a usual place to eat . Great food (Mexican) people are very nice . Is not a fancy restaurant with all kind electronics things . It's a mom and pops place . Food is real you can get as Mexican culture . Try!!! But be OPEN MIND", "stars": 4.0, "date": "2017-12-03"}, {"review_id": "dSFvaUOXAp", "review": "Ok, but a little bit expensive\n\nAlso they take to long to serve the food.\n\nParking space always crowd by other store customers", "stars": 3.0, "date": "2015-05-02"}, {"review_id": "vsu17jlrwc", "review": "Reading through previous reviews, I can only question with a good heart those who may consider this a place to know and enjoy real Mexican food. I was born and raised in Mexico City. This joint is as Mexican as McDonald's may be the American flagship for hamburgers.", "stars": 2.0, "date": "2013-09-20"}, {"review_id": "EdOTOkUm83", "review": "This place is so authentic, we've based a lunch taco club around this place.  Many of the local chef's (and some not local) make the trek over for lunch.  \n\nI've got a client in Mexico again, and I tell you with all honesty, this is authentic.  Like I said, forget English, and forget take out.  \n\nRemember, simple taco's are about the sides.  Pile on the sauce, onions, and cilantro!", "stars": 5.0, "date": "2013-06-06"}, {"review_id": "Egq0B3jnpe", "review": "I LOVE this place! Hands down, the best authentic Mexican I've had around here! I make special trips there solely for their chorizo torta. It is heavenly. My daughter loves their tamales. \n\nTrue, the staff doesn't speak much English, but most of the other patrons are bilingual and friendly, and don't  mind translating.", "stars": 4.0, "date": "2011-08-30"}, {"review_id": "KehlWwCqun", "review": "So so good! It's great to have an authentic mexican taco. Everything is so fresh and the atmosphere is really great. very refreshing and a great experience.", "stars": 5.0, "date": "2015-07-06"}, {"review_id": "uNF9IZD2Yn", "review": "If you go on weekends be prepared to wait. This place gets busy. It is a small restaurant, but you know if it gets that crowed the food must be good, and it is. I had Pastor taco, steak taco, and chorizo and huevo taco. They make the corn tortillas right there. My friend had lengua tacos and tripe tacos, he said they were good too. I also had a tamale, delicious. \n\nIt didn't  make it to 5 stars because  it is to small of a place.", "stars": 4.0, "date": "2016-08-05"}, {"review_id": "-8n-6Al6kW", "review": "You simply can't find a better Mexican place in Wilmington.  It's delicious and inexpensive.  Bring $20 cash, and you'll have enough left over to visit their other company, the ice cream place next door (Paleteria y Neveria Tocumbo) for a paleta.  I highly recommend both of these establishments!", "stars": 5.0, "date": "2014-09-07"}, {"review_id": "MlQdUzaQeX", "review": "Popped in on spur of the moment in Wilmington prices corner area...lived right across the street 35 years ago and this place never existed.... Real good food ...big shout out $", "stars": 4.0, "date": "2017-09-13"}], "aspect_scores": {"speed": 0.0, "food": 1.0, "value": -0.5, "ambiance": 0.0, "consistency": 0.0, "service": 0.0, "portions": 0.0, "drinks": 0.0, "quiet": 0.0, "private": 0.0, "outdoor": 0.0, "parking": 0.0, "freshness": 0.0, "vegetarian": 0.0, "staff": 0.0, "ordering": 0.0}, "gold_labels": {"C0": -1, "C1": 0, "C2": -1, "C3": -1, "C4": -1, "C5": -1, "C6": -1, "C7": -1}}
{"item_id": "VrGxoSNZfSiT", "item_name": "Sunset 44 Bistro", "city": "Saint Louis", "neighborhood": "Saint Louis", "price_range": "$$", "cuisine": ["Bars", "Lounges", "American (New)"], "item_data": [{"review_id": "4kHSo1GFuT", "review": "Everytime I pass by here, which is practically once a day, I remember the meals we had for dinner.  Or, perhaps more accurately, I  remember that we didn't like Sunset 44 precisely because the dinner was so unmemorable--- so very, terribly bland. No flavor, no pizzaz, no zing. Absolutely nothing to bring us back.", "stars": 1.0, "date": "2012-04-03"}, {"review_id": "IMoajHrmMv", "review": "A consistently wonderful venue for any occasion!  Bob Menendez is a class act and hires excellent folks to fulfill your every wish.  The food is superb!", "stars": 4.0, "date": "2015-01-04"}, {"review_id": "uvWbaPkVfL", "review": "This is one of favorites in Kirkwood. My go to happy hour (all night btw), date night, or book club with the girls! The service, drinks and food NEVER disappoint. The pours are very generous. I hesitate to even tell you how awesome it is because I don't want it too get too popular! ;)", "stars": 5.0, "date": "2018-08-05"}, {"review_id": "hnSjrCVPKv", "review": "Five ladies had lunch here this week.  Two of us had the quiche, others ordered a burger, an omelet and chicken salad.  All were pleased.  I thought the quiche was outstanding.  Actually, the best I have had.  We did wait awhile for the food to come to the table, and the restaurant was not busy.  The restaurant has a formal atmosphere -very nice.", "stars": 4.0, "date": "2015-12-24"}, {"review_id": "CXkS1JZUNb", "review": "Needed a private room for a family gathering. They were easy to work with. Friendly and helpful. The room was comfortable and nicely tucked away. Although I was a little concerned about the food from reading past comments, it was fantastic. The best I can figure is those past reviews are from a time when the cuisine was much different. The quality and variety of their food exceeded our expectations.", "stars": 5.0, "date": "2015-11-09"}, {"review_id": "yPTRaWTV0Q", "review": "Sunset 44 is a true hidden gem. The atmosphere is relaxed yet intimate. Our waiter, Blake was attentive and friendly. The braised short rib ravioli was one of the best ravioli dishes I've ever eaten. I would definitely recommend dining here and look forward to trying the other dishes on the menu.", "stars": 4.0, "date": "2017-02-23"}, {"review_id": "eTiy5LkPF4", "review": "This place is awesome. They totally stepped in to help my friends out and host their wedding reception when Schafley cancelled on them. \n\nAnd this place this place is way better than Schafley. The food was amazing and the battenders, waiters and staff were super attentive. We loved our evening there and look forward to going back for dinner the next time we are in St Louis.", "stars": 5.0, "date": "2017-01-18"}, {"review_id": "nvIYFp948Q", "review": "the food here is very good.  our server Karen was nice effecient and friendly.  Food came out hot and fresh although my rib eye was a little more than well done when I ordered it medium but that being said you could cut it with a butter knife so I did not complain.  We have hosted a couple of banquets here in the past and they were always accomodating and friendly.  Yes it is a bit pricey but well worth the trip.", "stars": 4.0, "date": "2012-04-15"}], "aspect_scores": {"speed": 0.0, "food": 0.83, "value": -1.0, "ambiance": 1.0, "consistency": 1.0, "service": 1.0, "portions": 0.0, "drinks": 0.0, "quiet": 2.0, "private": 0.0, "outdoor": 0.0, "parking": 0.0, "freshness": 0.0, "vegetarian": 0.0, "staff": 0.0, "ordering": 0.0}, "gold_labels": {"C0": -1, "C1": -1, "C2": -1, "C3": 0, "C4": -1, "C5": 0, "C6": -1, "C7": -1}}
{"item_id": "VZzivJEbmHIt", "item_name": "Subway", "city": "Brentwood", "neighborhood": "Brentwood", "price_range": "$$", "cuisine": ["Sandwiches", "Fast Food", "Restaurants"], "item_data": [{"review_id": "WBq2S1dhTm", "review": "Do not eat here. First of all, it took them about 3 weeks to fix their drink machine. Secondly, my coworkers and I got sick from eating here all on separate occasions. I feel like the employees there were not trained well too. They cant really make a good sandwich. I opened mine up and the meat fell everywhere. Maybe consider some better training and a quality of food check up. I generally like subway but this one has made me sick on multiple occasions.", "stars": 1.0, "date": "2016-12-04"}, {"review_id": "f-0P4HgQvt", "review": "Great food, clean establishment, and quick service. The store has been turned around for sure. The manager Breanna is doing a great job.", "stars": 5.0, "date": "2017-04-22"}, {"review_id": "8OCbRtYMBu", "review": "Been standing here 15 min now. Three people ahead of us, one ordering five subs and four pizzas, line behind us, one employee, poor guy is behind the counter all by himself, making subs, running the register, washing his hands, making more subs . . . is it a good business practice to leave an employee all alone like this and at the dinner rush hour?", "stars": 2.0, "date": "2014-03-23"}, {"review_id": "maqkaGL2XG", "review": "This is a clean and well run Subway.  When the line gets long during the lunch rush, they seem to process folks through pretty quickly.", "stars": 4.0, "date": "2012-05-15"}, {"review_id": "6NRos0ENE0", "review": "Usually good here but three out four got stale old bread, some of the staff was uncaring or untrained. Two out of four did not get their order how they wanted. Place is very clean. Will try again in week.", "stars": 3.0, "date": "2015-07-14"}, {"review_id": "Co8Kuvrsb_", "review": "Tried it again. Big mistake. I thought 2017 might help this subway but it did not. The food tastes disgusting. The lettuce is frozen. The chicken tastes like a sponge that has been soaked in watery chicken broth. The bell peppers are frozen. And THE DRINK MACHINE IS STILL BROKEN. IT HAS BEEN 3 MONTHS AND THEIR CARBONATED BEVERAGES ARE STILL FLAT. WHAT THE HECK.", "stars": 1.0, "date": "2017-03-06"}, {"review_id": "uQ8acLcjyc", "review": "Probably the best subway experience I've ever had, simply because of the costumer service experience. I think the dude's name was Shane... But he had an excellent witty/eccentric/dry commentary that was extremely amusing. Shout out to that dude.\n\nThe sandwich is good, too. I mean. It's Subway. Pretty consistent fast food sandwich.", "stars": 5.0, "date": "2015-10-14"}, {"review_id": "89u5jcXM5M", "review": "Went over to Subway last evening their were 2 employees in the store the guy was just standing their ehile the female waz doing all tbe work I went to the restroom 2 people in line same issue I left the store", "stars": 2.0, "date": "2016-01-11"}, {"review_id": "8OC9IdpJ1W", "review": "It's clean, it's fresh, but service is sub par and more from an attitude perspective. I expect better in Brentwood.", "stars": 3.0, "date": "2018-10-19"}, {"review_id": "yzKQAc6lU8", "review": "I'm sorry. This subway sandwichess are sub par. There is very little meat on it. Bread seemed old. It was just not good and I won t be back ever. Despite going to the nail salon next door twice a month.", "stars": 1.0, "date": "2020-01-31"}, {"review_id": "gLqjT0oW06", "review": "Two employees at lunch time is not enough to keep the line flowing. Much slower experience than other Subways. It's not the the fault of the two employees. They were hustling to keep up. Management of this location is surely trying to squeeze extra profits from the employee expense column.  The result is hard on employees and customers.", "stars": 3.0, "date": "2017-05-23"}], "aspect_scores": {"speed": 0.5, "food": -0.2, "value": 0.0, "ambiance": 0.0, "consistency": 1.0, "service": 0.0, "portions": 0.0, "drinks": 0.0, "quiet": 0.0, "private": 0.0, "outdoor": 0.0, "parking": 0.0, "freshness": -2.0, "vegetarian": 0.0, "staff": 0.0, "ordering": 0.0}, "gold_labels": {"C0": -1, "C1": -1, "C2": -1, "C3": -1, "C4": -1, "C5": 0, "C6": -1, "C7": -1}}
{"item_id": "Cdytv_YhJO0W", "item_name": "Nipper's Pub", "city": "Woodbury", "neighborhood": "Woodbury", "price_range": "$$", "cuisine": ["Nightlife", "Chicken Wings", "Pubs"], "item_data": [{"review_id": "AROrFmzRJw", "review": "Great place for lunch during the week.  Very cool little place to stop in in the middle of the day and have some good food and a drink.  Food is phenomenal.  I would definitely recommend the hot roast beef with roast beef gravy and horseradish on the side.  \n\nI've been here a couple of times for lunch but never for dinner or the weekends but they have a very nice menu.  Can't wait till summer time comes so I can hang out on the deck bar.", "stars": 5.0, "date": "2015-04-05"}, {"review_id": "ooDlLRn34S", "review": "Happy St Patty's Day! A night out with friends! Great bar friendly staff! Music!  Friendly crowd! Perfect drinks!", "stars": 4.0, "date": "2018-03-17"}, {"review_id": "w4oW9PHexD", "review": "Love coming here. Been for years. Drinks are well made. Staff is very friendly. Great servers! Love the outside patio. But c'mon, owner of Nipper's, put some money into maintenance! Dark inside (get rid of those cheap paper blinds) and brighten it up! Look at the front door entry! Place looking shabby!", "stars": 3.0, "date": "2017-05-16"}, {"review_id": "Yuryu2ePhn", "review": "I went into nippers pub when it was taco night. Each taco was a dollar or so but the meat was cold and it tasted very bland. I've been back and had other items which are good. Stay far away from the tacos though.", "stars": 2.0, "date": "2018-03-09"}, {"review_id": "_9fzk3G6J7", "review": "Came for the all you can eat snow crabs on a Monday, was not disappointed.  Crabs were great, staff was running around like crazy trying to keep up, and did a damn good job of it.", "stars": 5.0, "date": "2015-06-27"}, {"review_id": "XIZocE83oD", "review": "Second visit to Nipper's was last night. Went for drinks (which are super affordable). ended up ordering Nipper's Fries. Last visit had wings and a perfect cooked burger! Crowd is a mix of locals with some young kids mixed it.", "stars": 4.0, "date": "2018-07-15"}, {"review_id": "YEkb-xyCR0", "review": "Love coming here. Been for years. Drinks are well made. Staff is very friendly. Great servers! Love the outside patio. But c'mon, owner of Nipper's, put some money into maintenance! Dark inside (get rid of those cheap paper blinds) and brighten it up! Look at the front door entry! Place looking shabby!", "stars": 3.0, "date": "2017-05-18"}, {"review_id": "IibQU-htSp", "review": "Great neighborhood bar with tasty food and friendly staff! Nice deck and great wings - half price on Wednesday!", "stars": 5.0, "date": "2016-06-19"}, {"review_id": "7QEdryFg1F", "review": "Love coming here. Been for years. Drinks are well made. Staff is very friendly. Great servers! Love the outside patio. But c'mon, owner of Nipper's, put some money into maintenance! Dark inside (get rid of those cheap paper blinds) and brighten it up! Look at the front door entry! Place looking shabby!", "stars": 3.0, "date": "2017-08-15"}, {"review_id": "zJRKltULjF", "review": "Best bar food in South Jersey. They have $1 tacos on Tuesdays, half priced wings on Wednesday's, all you can eat crabs two days a week.", "stars": 5.0, "date": "2019-07-02"}], "aspect_scores": {"speed": 0.0, "food": 0.88, "value": 1.0, "ambiance": 0.0, "consistency": 0.0, "service": 1.0, "portions": 0.0, "drinks": 0.0, "quiet": 0.0, "private": 0.0, "outdoor": 0.0, "parking": 0.0, "freshness": 0.0, "vegetarian": 0.0, "staff": 1.0, "ordering": 0.0}, "gold_labels": {"C0": -1, "C1": -1, "C2": -1, "C3": 0, "C4": -1, "C5": -1, "C6": -1, "C7": 0}}
{"item_id": "9C2rpb56aQvW", "item_name": "Home Plate Sports Pub", "city": "Tucson", "neighborhood": "Tucson", "price_range": "$$", "cuisine": ["Bars", "Restaurants", "Sports Bars"], "item_data": [{"review_id": "fKlVmrTQ-N", "review": "Great place to take family!! Day bartender is great!! Kind to kids and always keep our drinks topped!!\nGreat darts! Great cages!!", "stars": 5.0, "date": "2017-08-16"}, {"review_id": "aEnOY67K5P", "review": "The reviews are true. All of them. Depending on what irks you, you'll love this place or leave pissed off and possibly disgusted. I love baseball and have been coming here since I was a kid so I'm probably a bit bias.", "stars": 4.0, "date": "2018-06-19"}, {"review_id": "Q4WycjNdD2", "review": "Pro's:\nVideo games\nSports on TV's (when the owner is around)\nBatting cages\ncold beer\ncheap prices\n50% chance of getting a good and nice bartender\n\n\nCons:\nCrappy food\n50% chance of getting an angry beast of a bartender with a terrible attitude and horrific service.", "stars": 2.0, "date": "2016-02-01"}, {"review_id": "SUU2Dojf6G", "review": "Your typical dive bar, but this place is always packed! I make a quick stop by here before Wednesday evening softball games . Cheap beer and batting cages are my main attraction. Park just down the street though, the lot is cramped and busting out the seams!", "stars": 3.0, "date": "2012-05-15"}, {"review_id": "hMmgqTay8P", "review": "Finally found a place to hang out with fellow Washington redskins fans!! Friendly bar tenders, plenty of tvs to catch multiple games on cold beer an great food too. The really nice thing is u can order a large pitcher of beer but they break it down into two smaller ones for u, then give u a token to redeem the second one later so it's not just sitting on ur table getting hot while u finish the first one! Love it!!\n\nGo redskins!!!!!!!!", "stars": 5.0, "date": "2012-10-09"}, {"review_id": "zCEeXY_IO1", "review": "I love getting a beer and hitting the batting cages. The bartender has been the same lady each time I have gone. I noticed other comments stating she was mean, but she has always been real kind to me and my friends. I have seen plenty of people deserve the \"rather\" and she usually handles them well. \nSide note, I always meet one person that ends up being really cool. So, the patrons are a decent crowd.\nDrinks are good.\nFood is not very good.\nCages are good.", "stars": 4.0, "date": "2018-05-31"}, {"review_id": "Y5kQ_DsLyW", "review": "This place is just plain fun.  Is it pretty?  No (c'mon...it's on 22nd).  But it's a good place to hang out, share a pitcher of beer with friends, and fool around.  Pool tables, shoot em up games, darts, stuffed animal grab machines...  Plus they have batting cages!  Yes, batting cages at a bar.  The insurance premiums must be sky-high.  Have a couple beers and see if you can hit the 80+ mph Nolan Ryan pitches.  Crazy.  And a lot of Tucson fun.", "stars": 3.0, "date": "2011-09-07"}, {"review_id": "s7U9HQIKTU", "review": "Good value. 75¢ for 12 pitches, and you can decide the speed of the cage you go into- up to 75 miles an hour. Both baseball and softballs available. \nA ball hit my sisters thumb, followed by dramatic tears. And a staff member was quick to bring ice without even asking him. Showed good initiative. \nThen the family played a competitive game of $1 pool. Neat video games. Beer smell. Didn't have food so can't comment on that.", "stars": 4.0, "date": "2018-05-17"}], "aspect_scores": {"speed": 1.0, "food": 1.0, "value": 1.0, "ambiance": 0.0, "consistency": 0.0, "service": 0.0, "portions": 0.0, "drinks": 0.0, "quiet": 0.0, "private": 0.0, "outdoor": 0.0, "parking": 0.0, "freshness": 0.0, "vegetarian": 0.0, "staff": 0.0, "ordering": 0.0}, "gold_labels": {"C0": 1, "C1": 0, "C2": 1, "C3": -1, "C4": 0, "C5": -1, "C6": 0, "C7": 0}}
