{"review_id": "ByWrIEO1Uq5ed0-2y2ZKAQ", "business_id": "dYinIkKBspHV5hSaukklFg", "user_id": "Cz4WjGqkH0Dwkxp-KlRaKg", "stars": 1.0, "text": "The four and five star ratings are all fake,friends and family of staff wrote them. The food here is sub-par, I took friends here and they were appalled. The first time I ate here it was good, then downhill they went. They use cheap ingredients, pasta is purchased at Restaurant Depot and they use cheap canola/soy oil blends to save money. They don't even use olive oil but they charge you like they do!!!  You'd NEVER find a restaurant in Italy using these cheap oils, only olive oil. Roasted Romaine salad tastes like propane or kerosene.\n They cut corners wherever they can and believe me, they are not cheap. The original restaurant in South Philly is so much better. This place is a rip-off, bread is stale and tasteless, the only good thing is the waitstaff, I have to say they are very nice. POOR quality food. My friend could not eat her meal it was so bad so she took it home in a doggie bag and even her dog would not eat it!! Yes, it is that bad. SAVE  your money and eat in a real Italian restaurant. I'd rather buy home made pasta at Carlino's and make it at home myself. I am telling you, the food tastes like propane or kerosene. Can't be good for you. CHEAP, CHEAP,CHEAP quality, but they charge you like it's a gourmet dining experience. They BUY their pastas at Restaurant Depot. NOT HOMEMADE! SAVE YOUR MONEY and your health. BAD food!! Just BAD! I cannot stress this enough! I don't care what anyone says, the food is AWFUL, GARBAGE!!", "date": "2019-07-27 01:48:47", "useful": 0, "funny": 1, "cool": 0, "user": {"user_id": "User_077", "name": "M", "review_count": 14, "yelping_since": "2011-08-09 22:46:48", "friends": [], "elite": [], "average_stars": 1.56, "fans": 0}}
{"review_id": "MK_gVKkkLjCC97yjh95u2A", "business_id": "dYinIkKBspHV5hSaukklFg", "user_id": "kNmVQUglct8dmS10HvW5mw", "stars": 1.0, "text": "I went to this placed based on the reviews I read on Yelp hoping  to find another one of those great little neighborhood places that most people don't know about like Macaroni's in NE Philly on old welsh rd, wow! What a dissapointment. Where do I start, the parking was awful! But, to be expected given the location, the place looked dirty and cramped but I can get past all of that if the food is good,  unfortunately that wasn't the case. The service was bad I felt rushed the whole time I was there. Yhey didn't take a drink orderwhen half way through our meal my date asked for a soda the waiter brought over a dirty glass and a can and just left it on the table. The meals we ordered had no presentation and were not tasty at all, I am a person who eats out 3-4 times a week and have no problem trying new places or traveling to find good food. I was horribly disappointed with everything from the service to the quality  and taste of the food, I don't know if it was a bad night or what. Obviously alot of people like this place,look at the reviews it gets! I just don't understand how. I had a awful experience in every way and would never recommend in any way.SORRY!", "date": "2012-03-16 15:51:17", "useful": 0, "funny": 0, "cool": 0, "user": {"user_id": "User_278", "name": "William", "review_count": 11, "yelping_since": "2012-03-16 15:12:13", "friends": [], "elite": [], "average_stars": 3.92, "fans": 0}}
{"review_id": "-y79qu0kgBkM5ZxV-zefjw", "business_id": "dYinIkKBspHV5hSaukklFg", "user_id": "--i-QAkjRr8Ozr9SzokiQQ", "stars": 1.0, "text": "I want to start off by saying I love, love Italian food!  Soooo, after reading all of the wonderful reviews everyone wrote I couldn't wait till my reservation time was near!  I starved myself all day expecting to really eat everything I possibly could, def not the case!!!! \nI ordered my favorite dish of lobster ravioli, what a disappointment!  The caprese salad I ordered was average at best!  I had to ask in the middle of my meal if they even offered anything other then water to drink.  I was then given a can of soda at my table.  From the moment we walked in to the moment we walked out it was 35 minutes!!!!  We were rushed and completely unsatisfied!  \nUpon leaving the restaurant my guest and I came to the conclusion we would have had a better meal and service had we gone to the Olive Garden!  Now that's BAD!!!!!!!!\nSo, If you want to be rushed, have little selection on the less then impressive menu and eat average food this is your place!  \nWouldn't ever waste my time again.", "date": "2012-03-16 17:46:39", "useful": 0, "funny": 0, "cool": 0, "user": {"user_id": "User_001", "name": "Jan", "review_count": 7, "yelping_since": "2012-03-16 17:28:26", "friends": [], "elite": [], "average_stars": 3.86, "fans": 0}}
{"review_id": "QFOL9BwYSivs4dr41umAVw", "business_id": "dYinIkKBspHV5hSaukklFg", "user_id": "Jn1rMNrvFMjbx3F35yItKw", "stars": 1.0, "text": "I never ever leave reviews but I just called to place an order for pick up and the guy who awnsered the phone to take my order was incredibly rude. I simply asked 2 questions, if they accept take out orders and if they had a lunch menu. He was condescending towards me while telling me to just look at the website. All you had to say was yes or no. I already knew what I wanted to order I just didn't know if there was 2 different menu options. As soon as he told me to look at the website he said he had to put me on hold. Trust me I wouldn't write this unless he was being a real dick to me. I hung up and took my business to another restaurant on the same block. This restaurant will never get my business now.", "date": "2017-02-14 19:00:25", "useful": 2, "funny": 3, "cool": 0, "user": {"user_id": "User_104", "name": "Tim", "review_count": 2, "yelping_since": "2014-04-24 01:14:44", "friends": [], "elite": [], "average_stars": 3.0, "fans": 0}}
{"review_id": "Wy3WGldtiLN72vAYAA320g", "business_id": "dYinIkKBspHV5hSaukklFg", "user_id": "5PyfIcmMjFFDHohr1jNOgg", "stars": 2.0, "text": "I read all the reviews, consulted with my fellow foodies.. and all were praising this tiny restaurant for its \"authentic Italian food.\" I beg to differ.  It is small, cramped, and the seating was too close for my comfort. I did enjoy walking through the open kitchen upon arrival... but the meal.. I have had better in South Philly. The bread is warm, and very fresh. My bread plate had a huge chip on it... with so many servers running around, you would think that one of them would notice it, and trash it before it was placed on a table. The caesar salad resembled every other salad I've had in this city, minus the excess of dressing, which was a nice surprise.  But still, it was an average salad. The mussels in red sauce tasted a bit on the fishy side, and cold.  The red sauce was rather bland, and flat. On to the entree's... I ordered the Spaghetti Bolognese - which other bloggers & friends raved about.  It was on the salty side, and needed more gravy. I had to ask for an extra side of red sauce - which made a world of difference; in both twirling the pasta, and adding to the flavor.  I did not find the service to be great, nor did I get any \"warmth\" from the many servers that were running around. It all seemed very rushed, and chaotic.  Needless to say.. we had 5:30pm reservations (the only time that was available...).. so I expected to have more of a \"relaxed\" dining experience, as opposed to a \"fast\" dining experience.  My dining companions were not impressed with their meals either.  Both commented that their entree's were lacking sauce, and spice.  At the end of the meal, one of the wait staff asked us in passing if we wanted coffee.  Not dessert.. but coffee.  We asked what the desserts were, and the waiter appeared to be annoyed with this question as if we we were over extending our stay in the short hour that we were there... no coffee, nor dessert was ordered. I left, uninspired, and disappointed.  This was not the great meal that I anticipated.  I will continue to go to the many other great Italian restaurants that South Philly, and the rest of the city has to offer.  By the way, this is the place that I chose to go for my birthday... good thing it was the night before, and not the day of. One last note.. never got the lemoncello shot at the end of the meal that they are supposedly famous for.", "date": "2009-02-01 02:15:44", "useful": 0, "funny": 0, "cool": 0, "user": {"user_id": "User_026", "name": "Mara", "review_count": 72, "yelping_since": "2009-01-23 21:22:23", "friends": [], "elite": [], "average_stars": 3.05, "fans": 1}}
{"review_id": "dtSFuWhkoom4f04AEUXG3g", "business_id": "dYinIkKBspHV5hSaukklFg", "user_id": "dFwQrEAxhvv1DkSVSZ0mDA", "stars": 2.0, "text": "I was not a fan. I was a human being attempting to satiate my appetite on a nice fall evening, and I was greatly disappointed. My darling lover and I wanted to enjoy a nice Italian dinner (as lovers do), but ended up wishing we had settled for take-out. Our server was nice and friendly, but the dining area was cramped - I had to side-step between other patrons just to get to my seat in the corner of the restaurant.\n\nFor appetizers, we ordered the grilled romaine (a special that night), and the grilled calamari. The calamari was slightly undercooked, and the grilled romaine left an unpleasant oily residue on my lips - I felt like I had just made out with a vat of vegetable oil. Slightly disappointed, we were looking forward to our mean course. My darling beau ordered the lobster ravioli; I, the ribbon pasta was shredded boar ragu (a special). The wait time was not long, but I felt my face drop as soon as the meal was set before us. The portion of pasta was very small - about the size of my fist. I was assured by our waiter that it was a hearty portion, but it barely put a dent in my appetite at all. My better half said that the lobster ravioli did not taste fresh.\n\nI don't go into any restaurant expecting it to be the best, but this was a let down on several levels. For the price, there is no reason why I should order an appetizer and entree, eat everything on my plates, and still leave hungry, feeling that the bread was the best part of the meal.\n\nI'll just put it this way - this place made me want Olive Garden.", "date": "2013-10-08 17:08:50", "useful": 0, "funny": 0, "cool": 0, "user": {"user_id": "User_234", "name": "Justin", "review_count": 3, "yelping_since": "2013-10-07 19:47:25", "friends": [], "elite": [], "average_stars": 2.67, "fans": 0}}
{"review_id": "TKT9n-jIhV1vLOjwDVgbCQ", "business_id": "dYinIkKBspHV5hSaukklFg", "user_id": "8gSIDxzwXsIUh1-urX2t8A", "stars": 2.0, "text": "So this is a BYO Italian ristorante. We got there in the evening but it was hard to locate it since the entrance is tiny and the lighting is very poor! Parking is not easy either. The place is rather small, but very friendly. The service is great too. However, the food is metzo metzo! It's a great place if you go with a group of over 6 since they line up the tables very fast to accommodate your numbers. We were the only young group in this place, most of their clients are older and family type of clients--as if they have been going here from generation to generation! So I guess for some Italians it is like home cooking, but frankly I thought I make better Italian pasta. We all had variation of pasta meals and we all thought it was average. The bread was very good though. The place was also a little cold!", "date": "2010-01-13 15:51:44", "useful": 2, "funny": 0, "cool": 1, "user": {"user_id": "User_044", "name": "gigi", "review_count": 26, "yelping_since": "2009-12-29 03:28:21", "friends": [], "elite": [], "average_stars": 3.27, "fans": 1}}
{"review_id": "dY8Gy9Ej4SOwlWILiWE62Q", "business_id": "dYinIkKBspHV5hSaukklFg", "user_id": "42D8UPKrq8oDOPwGysuEMw", "stars": 2.0, "text": "I went here for dinner solely based on it getting such high reviews from yelp, and I was so disappointed!\n\nWAY too many tables. It feels like somebody must have told them that lots of  people mistake an overpacked Italian restaurant for a \"charming hole-in-the-wall.\" Lots of 20-something year old girls eating dinner and pretending to be in Sex and the City. Food is somewhere between fair and good, and a bit overpriced. Wait staff is very friendly and attentive.\n\nThe best part was that right after my boyfriend made the Sex and the City reference, we heard a guy two tables over making the same remark to his dining partner.", "date": "2010-12-21 17:44:47", "useful": 2, "funny": 6, "cool": 3, "user": {"user_id": "User_022", "name": "Jessica", "review_count": 113, "yelping_since": "2010-12-05 02:26:40", "friends": ["User_079", "User_039", "User_080", "User_359", "User_032", "User_311", "User_086"], "elite": ["2011"], "average_stars": 3.56, "fans": 13}}
{"review_id": "1b7GisQ-QJEKBy9d7lswkw", "business_id": "dYinIkKBspHV5hSaukklFg", "user_id": "KwMpbm3hkfR9OslAbOTbBQ", "stars": 3.0, "text": "Since I am a HUGE yelper, I took everyones high recommendations of this quiant BYOB.  Little did I know it was the poorest reflection of what we actually experienced when we dined here on a relatively slow Valentine's day evening.  When you have to ask for napkins, you know you're in for bad service.... I had no idea how bad.  After we ordered our meals, we never saw our server again.  Our appetizers and entrees were nicely spaced out, but we had to ask for bread... that is one of my biggest pet peves.  Our water nor iced tea were refilled all night.  The couple who sat next to us arriving some time after us, were done and gone with dessert before we even were asked to wrap up our unfinished meals.  May I add, the same couple was highly demanding throughout the entire evening, even altering their appetizers and entrees... they chopped up the croutons finer because he thought they were too large??  HAHA  I didn't realize they custom served here.  I was so disappointed in my selection in L'Angolo, it wasn't just Valentine's day, but our anniversary.  What a huge disappointment.  I was tempted to get dessert, because unlike their pasta, it is supposedly homemade.  We had to pass because we felt purposefully ignored all night long.  While the douchbag next to us was getting special treatment, we were the layed back couple getting the worst service I have ever received...  There was a woman walking around, obviously not a server, doing absolutely nothing.  Our bus boy gave us more attention than the server, and while he was polite our server was busy tasting wine with what appeared to be regulars on the opposite side of the dining room.  What a joke.  We had to ask the bus boy and the only other server for our check 4 times.  I actually started putting on my coat, as a signal... like we'll leave if you don't want to get paid for this mediocre meal, at best.  Needless to say, we won't be returning, and neither should you if you're looking for good service. I hope the server reads this frank review, as he should know why he didn't get 20% tip... and I am typically a very generous tipper.  Thanks for the wine, as we had forgot ours... it was the only bit of service we received all night.", "date": "2015-02-15 02:14:23", "useful": 1, "funny": 0, "cool": 0, "user": {"user_id": "User_113", "name": "Christine", "review_count": 29, "yelping_since": "2011-09-02 20:58:37", "friends": [], "elite": [], "average_stars": 4.45, "fans": 2}}
