{"review_id": "qTcSdTrKBk5yTF0WfHF7pA", "business_id": "CYSPKiVdoPX3erovujnE9Q", "user_id": "L5Ay57EOHoc-lI9bcGkexA", "stars": 1.0, "text": "This place was the biggest rip off for restaurant week, and my review will be based mainly off my experience during restaurant week. First off, I would like to start out with the fact that I went with a party of five people. \n\nTo start off, the food:\nOur courses consisted of the romaine & endive salad, charcuterie, garlic prawns, rooster's comb mac & cheese, hanger steak, jersey corn & the dessert was chocolate cake, respectively. The romaine & endive salad was okay. In all honesty, it was just a subpar caesar salad and not worth the $9 they typically charge. They gave us two bowls of salad to feed five people, and I believe from their normal portion sizes that it should have only fed one person. The only reason why it was taken back unfinished was the fact that the salad just bad. There was a bitter note that I wasn't used to, and I've eaten many caesar salads. Second, the charcuterie was probably one of two decent sized portions to feed the five of us. My colleagues enjoyed it, but I found the meats a little too salty. Third, the garlic prawns were probably the best thing on the menu. I would normally not have anything to say if it were just me, but there were five of us and there were five prawns, so each of us got a single prawn. Onto the next course, Rooster's comb mac & cheese was the second decently sized portion on the menu for restaurant week. We received two normal sized portions to split amongst the five of us, and while the taste and portions were just okay, we could have probably used another dish and finished that too. Now onto the entree, the hanger steak & jersey corn as the side. The hanger steaks were around 6 ounces each, and we received two of them, so each of us got around 2-3 ounces of steak. The steak was more rare than any of us would like, and although it was rare, it still required more chew than usual. As a side dish, we thought that the jersey corn would come with the hanger steak as that's how sides are typically served, on the side along with your entree. We had to ask where our side was, and it wasn't served until after we were all done with the entree. Jersey corn was good flavor wise, but we didn't appreciate how the server was defensive when we had to ask where our food was and said he liked to call their kitchen a \"free flowing kitchen,\" apparently basically meaning it can come out when it comes out‍.  Everyone had half a corn on the cob each. We ended off with chocolate cake that came with the meal, and it was just okay, nothing spectacular and nothing extravagent. Maybe a 2x4 inch rectangular piece of dark chocolate cake. It was quite dark, so if dark chocolate is not your thing, this will not suit your tastebuds. \n\nNext, the prices:\nThe portion sizes were in no way different than what they would serve during their regular weeks, except when they gave us two portions of the salad, mac & cheese, & steak. Our bill ended up being around $270 because we ordered more drinks & included tax & tip. I will calculate this as if it weren't restaurant week to see if it was worth our money. Two salads at $9 each, one order of charcuterie at $15 because the meats & bread didn't look to be any larger than what they normally serve with a regular order, ONE ORDER of garlic prawns at $13 (I'm calculating this as one order because they gave us five prawns, and I looked at previous pictures that others posted and it looks to be the same size, so this can only be calculated as one order), 2x mac & cheese at $15 each, 2x hanger steaks at $20 each, and I'm not exactly sure how much the Jersey corn is but I'll just mark it as 2 dishes at $8 each because I highly doubt it could be more than $10. If this were a regular day and not restaurant week, our total would have been at most $150 not including drinks, so I think we ended up losing money. \n\nOverall & needless to say, no one should come here for restaurant week. We all would have been happier and more full if we just did happy hour right at the bar. I will repeat do‍not‍come‍here‍for‍restaurant‍week", "date": "2019-09-26 16:01:48", "useful": 3, "funny": 0, "cool": 0, "user": {"user_id": "User_132", "name": "Mary", "review_count": 26, "yelping_since": "2013-11-10 14:39:22", "friends": [], "elite": [], "average_stars": 4.0, "fans": 0}}
{"review_id": "279De2Ata9RRQmP4aYW1jA", "business_id": "CYSPKiVdoPX3erovujnE9Q", "user_id": "hlbh5vYJT0v3UwU7ddzJPQ", "stars": 1.0, "text": "The worst dining experience in Philadelphia. Clearly Schulson is more interested in revenue and $$$ than customer service. So work with me while I walk you through everything that is wrong with this over priced under performing dump....\n\n1. Usually when you make a reservation the intention is to arrive and be seated give and take within 5-10 minutes. We booked 3 weeks in advance for a table of 6. We arrived at 8:45 and there was a Congo line of other patrons waiting to be seated. We were told that our table would be ready within 10 minutes and was asked to go to the bar which was already 3 deep...30 minutes later and hovering in the front desk area being bumped around by waiters we were still waiting for our table. The best that the front desk could offer was \"my manager will come see you at the table\"...whatever that means. For the record no manager turned up. For it to take 30 minutes post reservation time to be seated and settled is a joke at best.\n\n2. After being seated we awaited a further 20 minutes to put a drinks order in and then a further 30 minutes for the drinks to arrive. That's now a 50 minute seating time on top of the 30 minutes waiting for the table. So we are 80 minutes and no closer to putting in an order for food...\n\n3. In order to speed things up we ordered our starters and mains together - and surprise surprise our food was drip fed from the kitchen. First the cold and flavorless cheesesteak egg rolls followed by the chicken dumplings that had less flavor than boiled tofu. No apology and no concern from any staff that orders were being served cold and without any consistency. \n\n4. By the time the mains arrived the dining experience was in the toilet. And that's being polite..Half the table received their mains and the other half waited and it wasn't until we prompted the waiter that we got the pasta that resembled something served out of a can from the shelves of Target...the chef is lucky to be employed if that's the best they could literally serve up. \n\n5. The staff are so competent that they even know how to damage your sweater while you are waiting for your food...see photo of my new sweater which was torn by our waiter. Was an accident but not even an apology was forthcoming let alone an offer to repair or reimburse us for it.  \n\nIn the midst of covid it's fair to say that we all need patience but this dining experience was a joke and makes you wonder why any of us should support local restaurants when all they care about if jamming us in and serving us half hearted service (if that) and lousy food that wouldn't even make the cut at the frozen section of your local supermarket. I very rarely have poor dining experiences but this was beyond poor. A high school canteen not only has better customer service but better food. If you are visiting Philly, stay away from the Schulson group of eateries - quite simply an embarrassment to the hospitality industry.", "date": "2021-12-05 04:38:27", "useful": 2, "funny": 1, "cool": 0, "user": {"user_id": "User_256", "name": "Kav", "review_count": 3, "yelping_since": "2019-07-13 21:08:33", "friends": [], "elite": [], "average_stars": 1.0, "fans": 0}}
{"review_id": "Dc9vKcmmEoh3i2nFDW-q5A", "business_id": "CYSPKiVdoPX3erovujnE9Q", "user_id": "c5A2f4yS4XxO9CUQiPZ5sQ", "stars": 1.0, "text": "How do I say this? I write this review with disappointment, slight anger, and overall confusion. Customer beware, this restaurant has strange policies, rude service, and random charges. \n\nI've been here before and was delighted by the food; the flavors were great, the dishes imaginative, etc. The service, I felt, was a little off but me and my friend nonetheless left very happily.\n\nI came here a couple of days ago with my father and my boyfriend. Admittedly, my father wasn't too hungry but was happy to buy me and my boyfriend a somewhat-fancy dinner. We chose the tasting menu for the two of us, and my father got a pizza.\n\nOf course, we asked first if it was alright if the two of us got the tasting menu, and my father got the pizza. The waitress, word for word, said \"Oh yeah, I don't care.\" So that was that; we were ready to fork over the extra $45 if it was going to be an issue. When she swung by with the first course, she said \"Just make sure my manager doesn't see you eat until the pizza.\" Weird, but... ok? \n\nThe dishes came on, and for the most part, it was great! My father admittedly picked a little bit - just to taste. He really was not all that hungry, and we figured since he was taking off my portion, there was no harm done. After all, they say the portions are cut out to the party, so no harm, right?\n\nOn came the pizza, and my father and I swapped a couple of slices. \n\nOn to the bill. She came over, surreptitiously placed it face-down, and left. When we flipped it over, we saw there was a random 6$ \"Extra Charge\" added to the bill. We asked, and she said, \"Oh yeah, well you guys were picking off like with the pizza, and it isn't going to be fair to others, and I don't want my manager to get me in trouble.\" \n\nMy father was like \"not fair to who?\" and the waitress blubbered about something. We were a bit in shock - what a strange policy! The waitress blindsided us, and it felt like we were getting pandered to. It was like \"oh, you were caught, so now you're randomly getting punished.\" Like we said - there's no delta for Harp&Crown, so this punishment is completely arbitrary, and on the account of the waitress \"catching us.\" Is this middle school? \n\nWe didn't want to make a scene, and obviously just paid and tipped. It took us a few hours to realize what happened, and we all just agree - good food, but what the hell just happened? Who just slaps on a random $6 charge (again, the amount doesn't matter, but the principal is just... wrong). \n\nI came to show off one of my favorite restaurants, and ended up just being disappointed by the quality of the waiters. I hope this becomes a more written-out policy, and I feel like it was quite underhanded to just randomly throw on a fee - where does it end?", "date": "2018-11-22 05:36:17", "useful": 7, "funny": 2, "cool": 0, "user": {"user_id": "User_227", "name": "Rachel", "review_count": 48, "yelping_since": "2017-08-03 00:28:35", "friends": [], "elite": [], "average_stars": 3.76, "fans": 4}}
{"review_id": "hFZquurQdnnRZjBGTY6ejQ", "business_id": "CYSPKiVdoPX3erovujnE9Q", "user_id": "WT36RE4WkUIaEbLDjkPB3g", "stars": 1.0, "text": "I was expecting great things from Michael Schulson and his wife Nina, but I couldn't be more disappointed.\n\nThe space itself upstairs looks nice but the layout is pretty bad.  It's like a half-assed bar that they then decided to add dinner tables to, and sitting at a table you feel like there's a constant stream of people walking by.\n\nWe were going to a party downstairs and it's apparently a huge production with the girl at the top of the stairs radio'ing downstairs to tell them she's \"sending people down\".  You go down into the basement, past a bunch of swinging doors for the kitchen, and then into a small room in the back that looks like it was decorated by a bunch of stoned college students with weird panels glued and nailed to the ceiling.  The crowd down there is anything but VIP, it was a bunch of older married guys dressed in loose fitting button down plaid shirts and drinking beer at the bar while all hitting on the two lone cougars who happened to be standing around.\n\nOn the way down, we were stopped in the hallway while Nina was in the process of screaming and yelling at a group of guys trying to leave because they wanted to use the elevator due to a cast on his leg.\n\nAfter getting downstairs, it only goes downhill.  Food is mediocre, but service is even worse.  Ordered drinks, then after she brought over 1/2 of the drink order, we ordered food.  Food was delivered, we reminded them we were still waiting for 2 of our drinks.  15 min later, still no drinks.  Had to grab her a third time to finally get her to bring me my drink . . . and it's not even crowded down there!  I will say that the burger was good, as were the fries (but not worth coming back for).  The duck foe gras dish was also good, but portion size was way too small.\n\nWhen I went to use the bathroom, I had to go back down the hallway to the kitchen area.  The single bathroom had towels and toilet paper on the floor and looked more like what you'd expect from a subway station than a nice restaurant.  \n\nGiven the staff's lack of service, the overpriced menu, the condition of the facilities, and the cherry on top -- the wild and rude owner Nina making a scene -- it's easy to recommend avoiding this spot and going to any one of the dozen+ other options within a 2-block radius from here.", "date": "2016-11-01 17:46:44", "useful": 14, "funny": 7, "cool": 0, "user": {"user_id": "User_195", "name": "Ron", "review_count": 439, "yelping_since": "2012-07-04 13:19:17", "friends": ["User_350", "User_334", "User_260", "User_320", "User_023", "User_214"], "elite": ["2013", "2014", "2015", "2016", "2017"], "average_stars": 3.65, "fans": 24}}
{"review_id": "2HajRRkrB-bPYay8EUe2lA", "business_id": "CYSPKiVdoPX3erovujnE9Q", "user_id": "pa6glQGbGNFP-FZhITV0pQ", "stars": 2.0, "text": "This review is solely based on the restaurant week experience. I was so surprised to see an eight-course meal menu for this restaurant CCD restaurant week official website, so I made a reservation right away for the first day of the restaurant week this past Sunday. We came with high expectations but left very disappointed. \n\nUnfortunately, their actual menu is not the same as the website. Because it was the first day of the restaurant week, the server was confused about their own menu. The website clearly listed that the pre-fixe pricing includes an eight-course meal (with the sixth course being the dry aged steak or grilled fish for two), and only the specialty cocktails are not part of the pre-fixe pricing. After multiple rounds of confusions, the manager decided to put a surcharge of $20pp/$10pp for the sixth course, but this surcharge was not even listed on the menu that was given to us. In addition, unlike the website claiming that only the sixth course is shared, we had to share each of the sixth course. Basically, the amount of food really is no different than a typical three/four course menu offered at other participants of restaurant week. Note: after the first day of restaurant week, the CCD website menu is now updated, although the restaurant manager claimed that they \"have no control of what's on the website\".  We were not given any sort of compensations for this discrepancy. \n\nNow, for the quality of dishes, we were even more disappointed. We ended up choosing the following six dishes from the menu and I've rated the dishes from one star * to four stars****. \n**Course 1 -Burrata Salad: The burrata was refreshing and paired well with the summer squash puree, but it was a really simple dish with very simple ingredients. There was no surprises, but did make a good start (at least that's what we thought). \n**Course 2 - White fish toast: The bread was toasted well, but the smoked fish was a little too salty. I did not hate the dish though. \n***Course 3 - Spanish Octopus: This was the best course of the meal. Initially we thought there was a generous amount but found out that most of the ingredients was potatoes. The octopus was cooked properly without being rubbery, and the flavors were on point and did taste like a proper Spanish tapa, although I've had much better ones at other tapa restaurants in Philly.\n*Course 4 - Gnudi: This is one of the worst pasta dish I've had in a while. It's supposed to be similar to gnocchi with ricotta filling, but it tasted so much worse than a properly cooked gnocchi. The dish was served before the octopus in the wrong sequence, and was already semi-cold to begin with. The ricotta was not runny, and the flour was even partially raw. We were glad that there was only two pieces because we would not eat more anyways. \n*Course 5 - broiled miso cod: the cod is served with red pepper relish and eggplant with a foamy miso sauce. The cod is good quality, but all the supporting ingredients were such a bad decision. The red pepper was overly flavorful, stealing the show from the freshness of the fish completely. The eggplant was not cooked through and semi-cold already. It was a weird decision to foam the miso sauce as all the flavors are gone. \n*Course 6 - Roasted whole cauliflower. The dish was completely cold when it was served as we witnessed the server made three trips around the room before it was served to us. After sending it back, the cauliflower shrunk in size with more charred pieces outside. We felt like they just threw it in the fryer again. It was not as good as the other reviews claimed, and the dish was easily achievable with an air fryer at home. \n*Dessert - they served us two pieces of chocolate that tasted somewhat like the cake you can buy at a grocery store. The server claimed that we can have a sorbet instead only if we're allergic. Note: they decided to remove the dessert from the menu.  \n\nWe did not enjoy the service for our table at all and it was nothing compared to the server for the table next to us. I'm not sure if it was because we pointed out their menu was different on the website. We understood that it was the first day of restaurant week, but we could not tolerate cold or raw food in a meal. We remember the name of our server but I would not point his name out in this review. \n\nThe ambiance for the restaurant was the only thing I thoroughly enjoyed. The decors and layout were very interesting, and I really enjoyed the side-by-side table for two people. The room temperature was a little too cold, and that might be another reason why the food was already cold when it was served.", "date": "2019-09-17 18:30:00", "useful": 3, "funny": 0, "cool": 1, "user": {"user_id": "User_302", "name": "Mandy", "review_count": 26, "yelping_since": "2015-06-27 17:08:57", "friends": [], "elite": [], "average_stars": 4.12, "fans": 5}}
{"review_id": "6zunylEY8xjmowwgN6hTnw", "business_id": "CYSPKiVdoPX3erovujnE9Q", "user_id": "uuDT_6wkC3NReUOD4q-6lQ", "stars": 2.0, "text": "The Excellent: Farro salad with mushrooms and soft egg, Brussels sprouts with chestnuts, burrata with pickled figs.\nThe Good: pizza with soppressata and shishito peppers\nThe So-So: cauliflower--too mushy, meatballs--just OK, prawns--eh\n\nDid not order dessert, the only one that looked interesting was $12 and that, my friends, is just ridiculous.\n\nExcellent drinks, but the size of mine was like those juice glasses from the high school cafeteria, only smaller. $10.\n\nCappuccino $4. We all ordered them. One cup was barely 1/2 full, but we just could not deal with sending it back.\n\nNothing was BAD except for the service. Aggressively paced, like they can not wait to turn over your table! Our server was good. But please do not bring the dessert menu when we are still eating our pizza. The runner and bussers were trying to clear our plates when there was still food on them! This happened 4 separate times, with 3 different people. Please let me eat my dinner at a pace that is not frantic. Drinks, small plates (please GOD When will this trend ever end?) and coffees--don't make me rush. This is not an inexpensive place. Do not try to push me out the door.\n\nWe asked a runner to send over our server so we could order another drink, and they asked US, \"Who's your server?\" Hello, really? She did introduce herself, but is it my job to know this?\n\nAlso, when our party of 4 arrived at 5:30 for our 5:30 reservation, the hostess brought us to a communal table for 10. When I asked if there were other tables (there were), she said that they were reserved for later. When I said that it could be awkward because we were going to be discussing some difficult issues (true, not even an excuse), could she please see about a table without others, she went to ask the manager and then brought us to our own table. I guess its just another thing you have to know about trendy restaurants--that you could end up with a bunch of strangers if you don't request your very own table!\n\nIt's nicely decorated. Very LOUD.", "date": "2016-11-23 03:11:05", "useful": 2, "funny": 0, "cool": 0, "user": {"user_id": "User_339", "name": "elyse", "review_count": 121, "yelping_since": "2009-12-05 14:27:47", "friends": [], "elite": [], "average_stars": 4.06, "fans": 1}}
